{"author":{"name":"Albert","type":"card","url":"https://albertdelafuente.com"},"content":{"html":"\n\n\u003ch2 id=\"high-level-summary\"\u003eHigh level summary\u003c/h2\u003e\n\n\u003cul\u003e\n\u003cli\u003eNothing can stop someone who don\u0026rsquo;t allow to be stopped\u003c/li\u003e\n\u003cli\u003eThe accountability mirror concept\u003c/li\u003e\n\u003cli\u003eThe cookie jar concept: split bigger objective into smaller ones and each achievement will be a cookie\u003c/li\u003e\n\u003cli\u003eThe 40%/60% rule: When you cannot take it anymore, you are at your 40%, you still have a lot to go\u0026hellip;\u003c/li\u003e\n\u003cli\u003eBattle against yourself, not against others\u003c/li\u003e\n\u003cli\u003eIt is a life-long mindset, not just a race\u003c/li\u003e\n\u003cli\u003ePush your limits in small percentages, maybe 10% each week of your previous limit\u003c/li\u003e\n\u003cli\u003eStretching is very important. Not doing it got him almost out of game\u003c/li\u003e\n\u003cli\u003eMindset: What if I can succeed at that task? What if I can prove everyone else wrong?\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"challenge-1\"\u003eChallenge 1\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eWhat kind of bullshit did you contend with growing up? (beaten, abused, bullied)\u003c/li\u003e\n\u003cli\u003eDo you feel insecure?\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eMaybe your limiting factor is that you grew up more supported and comfortable than what you think, you never pushed yourself.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eWrite/journal all te factors tat are limiting your success. Is soeone stading in your way? Are you underappreciated and overlooked for opportunities?\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eWhat are the long odds you are up against now? Are you standing in your own way?\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eShow your dirty laundry in detail. Tell your story in full.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eGive your pain shape. Absorb its power, you want to flip that sit.\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"challenge-2\"\u003eChallenge 2\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eWrite all your insecurities, dreams, and goals on post-its and tag up your accountability mirror\u003c/li\u003e\n\u003cli\u003eWhatever you need also: education, workouts\u003c/li\u003e\n\u003cli\u003eOwn being fucking fat, it is okay to be unkind wit yourself\u003c/li\u003e\n\u003cli\u003eTake goals and divide it into steps, write each step point of self-improvement as its own note.\n\n\u003cul\u003e\n\u003cli\u003eexample: Lose 40 pounds. Split into lose 2 pounds on te first week. Once achieved, remove tat note and post the next goal, of 2 to 5 pounds until te goal is realized.\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003eHold yourself accountable for that small step. It will take dedication and self-discipline\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"challenge-3\"\u003eChallenge 3\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eStep out of the comfort zone regularly\u003c/li\u003e\n\u003cli\u003eWrite the things taht make you uncomfortable\u003c/li\u003e\n\u003cli\u003eGo and do them, again, and again\u003c/li\u003e\n\u003cli\u003eMake something that sucks every day (bed, dishes, ironing, getting up early, running 2 miles, etc)\u003c/li\u003e\n\u003cli\u003eOnce it becomes comfortable, increase the discomfort\u003c/li\u003e\n\u003cli\u003eFocus on your weaknesses, not your strengths\u003c/li\u003e\n\u003cli\u003eThe more uncomfortable, the stronger you\u0026rsquo;ll become\u003c/li\u003e\n\u003c/ul\u003e\n","text":" High level summary  Nothing can stop someone who don\u0026rsquo;t allow to be stopped The accountability mirror concept The cookie jar concept: split bigger objective into smaller ones and each achievement will be a cookie The 40%/60% rule: When you cannot take it anymore, you are at your 40%, you still have a lot to go\u0026hellip; Battle against yourself, not against others It is a life-long mindset, not just a race Push your limits in small percentages, maybe 10% each week of your previous limit Stretching is very important. Not doing it got him almost out of game Mindset: What if I can succeed at that task? What if I can prove everyone else wrong?  Challenge 1  What kind of bullshit did you contend with growing up? (beaten, abused, bullied) Do you feel insecure? Maybe your limiting factor is that you grew up more supported and comfortable than what you think, you never pushed yourself.\n Write/journal all te factors tat are limiting your success. Is soeone stading in your way? Are you underappreciated and overlooked for opportunities?\n What are the long odds you are up against now? Are you standing in your own way?\n Show your dirty laundry in detail. Tell your story in full.\n Give your pain shape. Absorb its power, you want to flip that sit.\n  Challenge 2  Write all your insecurities, dreams, and goals on post-its and tag up your accountability mirror Whatever you need also: education, workouts Own being fucking fat, it is okay to be unkind wit yourself Take goals and divide it into steps, write each step point of self-improvement as its own note.  example: Lose 40 pounds. Split into lose 2 pounds on te first week. Once achieved, remove tat note and post the next goal, of 2 to 5 pounds until te goal is realized.  Hold yourself accountable for that small step. It will take dedication and self-discipline  Challenge 3  Step out of the comfort zone regularly Write the things taht make you uncomfortable Go and do them, again, and again Make something that sucks every day (bed, dishes, ironing, getting up early, running 2 miles, etc) Once it becomes comfortable, increase the discomfort Focus on your weaknesses, not your strengths The more uncomfortable, the stronger you\u0026rsquo;ll become  "},"name":"Book notes: Can't hurt me by David Goggins","published":"2023-01-11T00:00:00-03:00","summary":"High level summary  Nothing can stop someone who don\u0026rsquo;t allow to be stopped The accountability mirror concept The cookie jar concept: split bigger objective into smaller ones and each achievement will be a cookie The 40%/60% rule: When you cannot take it anymore, you are at your 40%, you still have a lot to go\u0026hellip; Battle against yourself, not against others It is a life-long mindset, not just a race Push your limits in small percentages, maybe 10% each week of your previous limit Stretching is very important.","type":"entry","url":"https://albertdelafuente.com/books/20230111063508-book_notes_can_t_hurt_me_by_david_goggins/"}