{"author":{"name":"Albert","type":"card","url":"https://albertdelafuente.com"},"children":[{"content":{"html":"\n\n\u003cp\u003eA good friend of mine motivated me to write down this post. I am not sure how I\nam going to address this in a \u0026ldquo;short\u0026rdquo; way since security and privacy is such a\nvast topic. It can be taken to several levels also, so it is a matter of how you\nactually compromise in favor of being usable and practical, since the power in\nplace make it difficult on purpose to have open alternatives that work.\u003c/p\u003e\n\n\u003cp\u003eI am going to do my best to divide this in different topics, \u003cstrong\u003ekeep it short and\nnon-technical\u003c/strong\u003e. It is going to be challenging.\u003c/p\u003e\n\n\u003ch2 id=\"desktop\"\u003eDesktop\u003c/h2\u003e\n\n\u003cp\u003eGNU/Linux is definitively the way to go. Personally I don\u0026rsquo;t trust Microsoft nor\nApple. In general I am an advocate of open source.\u003c/p\u003e\n\n\u003cp\u003ePersonally I have been using GNU/Linux since around 2000, and I am extremely\ncomfortable with it. I understand that it could be a challenge where we still\ndon\u0026rsquo;t have alternatives (or high quality tools) to some specific software like\nCAD. But at the same time Linux have better tools in many other aspects.\u003c/p\u003e\n\n\u003cp\u003eThere are different \u0026ldquo;distros\u0026rdquo; of GNU/Linux. A distro (or distribution) is the\nmixture of the tools from GNU, the Linux kernel and a way to manage packages.\nThis is a very simplistic definition, but I don\u0026rsquo;t want to get too technical\nhere.\u003c/p\u003e\n\n\u003cp\u003eDistributions for the beginners:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://ubuntu.com/\"\u003eUbuntu\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.opensuse.org/\"\u003eOpenSuSE\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://fedoraproject.org/\"\u003eFedora\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://linuxmint.com/\"\u003eLinux Mint\u003c/a\u003e (never tried it)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://manjaro.org/\"\u003eManjaro\u003c/a\u003e (never tried it)\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDistributions for more mature users:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.debian.org/\"\u003eDebian\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://archlinux.org/\"\u003eArch Linux\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.gentoo.org/\"\u003eGentoo\u003c/a\u003e (never tried it)\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2 id=\"mobile\"\u003eMobile\u003c/h2\u003e\n\n\u003cp\u003eBetween IPhone and Android, I will always chose Android. The reason being that\nAndroid has a hybrid open/close source development model. It is possible to get\nthe Vanilla version of Android without google play (actually nothing from\ngoogle) and then you can install an alternative to google play like F-Droid or\nAurora Store.\u003c/p\u003e\n\n\u003cp\u003eI don\u0026rsquo;t completely trust Aurora Store because it is a front end of Google Play\nitself, and software could have backdoors but I still think it could be a better\nalternative than have a phone that you paid for but Google owns.\u003c/p\u003e\n\n\u003cp\u003eJust like GNU/Linux, there are several distros. These can com \u0026ldquo;with gapps\u0026rdquo; or\n\u0026ldquo;without gapps\u0026rdquo;. Gapps being \u0026ldquo;Google Apps\u0026rdquo;, in other words, Google Play, Gmail,\nGoogle maps, etc. Without gapps is the way I prefer to go personally.\u003c/p\u003e\n\n\u003cp\u003eThere are several custom roms like:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eLineage\u003c/li\u003e\n\u003cli\u003eResurrection Remix\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://calyxos.org/features/\"\u003eCalyxOS\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://grapheneos.org/features\"\u003eGrapheneOS\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eThe most secure focus are Graphene and Calyx. Again, privacy and security is a\ndeep rabbit hole. As deep as you can afford to go.\u003c/p\u003e\n\n\u003cp\u003ePersonally I have been using Lineage for years and some custom mods. Every\nsingle Android device that I owned, I flashed and removed the original Android\nand replace it with a custom rom without Google Apps (nothing from Google). I\nhave been doing this since around 2006. I am very curious to try Calyx though.\nIf I would be starting from scratch, I would go for Calyx.\u003c/p\u003e\n\n\u003cp\u003eI have a Mediatek chipset on my phone and I hated it! That was definetively a\nbad purchase for this purposes. Don\u0026rsquo;t get me wrong, the phone is great, but it\nis not easier to flash a custom ROM. I would go for Qualcomm chipset instead and\nmake sure that the bootloader can be changed. \u003ca href=\"https://www.devicespecifications.com/en/model-cpu/47075c08\"\u003eThis Ulefone Armor 23 looks\npromising\u003c/a\u003e. Apparently the 24 will also come with a Qualcom chipset.\u003c/p\u003e\n\n\u003ch2 id=\"network\"\u003eNetwork\u003c/h2\u003e\n\n\u003cp\u003eWhen in doubt, use a VPN or TOR circuits. In this way your traffic remains more\nsecure. You can get a router that has that capability already built in, so you\ncan route everything through that device.\u003c/p\u003e\n\n\u003cp\u003eAlways use a firewall and disable the services you don\u0026rsquo;t use. Use strong passwords.\u003c/p\u003e\n\n\u003cp\u003eIf you are looking for an appliance that can do all of that you will need\nDD-WRT, pfSense or similar if you want a DIY approach and you are techie enough\nor go for a similar commercial solution like \u003ca href=\"https://www.youtube.com/watch?v=pdS1n_F11Dk\"\u003ethe BraxRouter\u003c/a\u003e (I am not affiliated\nin any way, and I haven\u0026rsquo;t tested it personally so be cautious and do your own\nresearch - DYOR).\u003c/p\u003e\n\n\u003ch2 id=\"authentication\"\u003eAuthentication\u003c/h2\u003e\n\n\u003cp\u003eI prefer avoiding using SMS authentication, I don\u0026rsquo;t trust the telephony system.\nThey have too much power and knowledge about their users.\u003c/p\u003e\n\n\u003cp\u003eI also avoid the Google prompts. Those who appears when you are trying to login\non your phone while you are trying to login on your computer. The reason is\nsimple, they tie your identity on the computer with your phone, because you will\nhave to \u0026ldquo;click\u0026rdquo; on your phone. All traffic will be related.\u003c/p\u003e\n\n\u003cp\u003eI don\u0026rsquo;t use Google Authenticator nor Authy, or any Android app for that matter\nunless it is opensource. Personally I use one on my computer, this brings extra\nsecurity and inconveniences. If I am not with my computer, I cannot login\nanywhere, even with my phone. I decided to live with that inconvenience.\u003c/p\u003e\n\n\u003cp\u003eUse 2FA (Second Factor Authentication) whenever possible, but with OTP (One TIme\nPassword) for that. I prefer free TOTP software, the caveat to this approach is\nthat you will have to handle your secrets yourself in a secure way, so you don\u0026rsquo;t\nlose them and nobody else has access to them. Please don\u0026rsquo;t even think about\nputting that into Dropbox!\u003c/p\u003e\n\n\u003cp\u003eI am a fairly technical guy so I prefer to keep the secrets under my control\nhaving encrypted backups than \u0026ldquo;trusting\u0026rdquo; any other party.\u003c/p\u003e\n\n\u003cp\u003eI am not going to disclose publicly here what I use for security reasons. But if\nyou know me personally and have questions ask me one on one and I will share\nmore about this.\u003c/p\u003e\n\n\u003cp\u003eIf you want more information, do your own research. I can point you to \u003ca href=\"https://www.youtube.com/watch?v=ChKpf5HjcSY\"\u003ethis video\u003c/a\u003e,\nas a quick overview. I think the title is a bit missleading though, I trust 2FA\nwith TOTP where the secrets are encrypted and properly backed up.\u003c/p\u003e\n\n\u003ch2 id=\"im-communications\"\u003eIM communications\u003c/h2\u003e\n\n\u003cp\u003eSignal or no signal\u0026hellip; that is the question\u0026hellip;\u003c/p\u003e\n\n\u003cp\u003eI have been a huge fan of Telegram. At the beginning, you did not needed to use\na phone number, it was just an account you created (and you could create as many\nas you wanted) and that was it. No verification and no ties to your identity.\nSadly, now they \u0026ldquo;require\u0026rdquo; a phone number, which is by design IMO. So I no longer\ntrust Telegram. The same argument goes for Signal.\u003c/p\u003e\n\n\u003cp\u003eI am aware of Signal\u0026rsquo;s history, even before it was signal and the original\ndevelopers, but again\u0026hellip; I don\u0026rsquo;t trust supplying my phone number to any app for\nany reason. There is no need for that, none.\u003c/p\u003e\n\n\u003cp\u003eI have always hated Whatsapp, security is crappy, it belongs to Meta. Huge user\nbase\u0026hellip; So many reasons that I wont even go there\u0026hellip;\u003c/p\u003e\n\n\u003cp\u003eMy preferred method for IM is XMPP which is federated in nature, so \u0026ldquo;no central\npoints\u0026rdquo; (again, loosely said). I would prefer to pick up a server that is not\ncrowded, it is in a country outside of \u003ca href=\"https://en.wikipedia.org/wiki/Five_Eyes\"\u003ethe 5 eyes\u003c/a\u003e\u0026nbsp;\u003csup class=\"footnote-ref\" id=\"fnref:fn-1\"\u003e\u003ca href=\"#fn:fn-1\"\u003e1\u003c/a\u003e\u003c/sup\u003e.\u003c/p\u003e\n\n\u003cp\u003eIn terms of privacy, OMEMO would be preferred, or asymmetric cryptography with\nGPG/PGP, or OTR (Off The Record) to say the least.\u003c/p\u003e\n\n\u003ch2 id=\"email-communications\"\u003eEmail communications\u003c/h2\u003e\n\n\u003cp\u003eThis is a topic that I struggled with for some time.\u003c/p\u003e\n\n\u003cp\u003eBottom line is I don\u0026rsquo;t trust large providers, because they are an easy target. Out\u003c/p\u003e\n\n\u003cp\u003eI wrote a note, which is not publicly available analyzing the email providers by\nApril of 2022. Before that I was using a really old google apps account that I\ncreated around 2005. It was very convenient, I am not going to lie, but I never\nfelt good about it so it was good that Google decided to kick me out by charging\nme. If I have to pay, I prefer to pay for something more friendly towards\nprivacy than to them.\u003c/p\u003e\n\n\u003cp\u003eHere is a table with a summary of some of the criteria that I used to analyze\nthose providers.\u003c/p\u003e\n\n\u003ctable\u003e\n\u003cthead\u003e\n\u003ctr\u003e\n\u003cth\u003eProvider\u003c/th\u003e\n\u003cth\u003eDomains\u003c/th\u003e\n\u003cth\u003eIMAP\u003c/th\u003e\n\u003cth\u003eLocation\u003c/th\u003e\n\u003cth\u003eEAR\u003c/th\u003e\n\u003cth\u003eCrypto pay\u003c/th\u003e\n\u003cth\u003eApp\u003c/th\u003e\n\u003cth\u003eAlias\u003c/th\u003e\n\u003cth\u003eStorage\u003c/th\u003e\n\u003cth\u003ePrice/m\u003c/th\u003e\n\u003cth\u003e2FA\u003c/th\u003e\n\u003cth\u003eCons\u003c/th\u003e\n\u003c/tr\u003e\n\u003c/thead\u003e\n\n\u003ctbody\u003e\n\u003ctr\u003e\n\u003ctd\u003eCounterMail\u003c/td\u003e\n\u003ctd\u003e15$\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eSweden\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003eBTC\u003c/td\u003e\n\u003ctd\u003eno\u003c/td\u003e\n\u003ctd\u003einf\u003c/td\u003e\n\u003ctd\u003e4G\u003c/td\u003e\n\u003ctd\u003e~5\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003esweden\u003c/strong\u003e\u003c/td\u003e\n\u003c/tr\u003e\n\n\u003ctr\u003e\n\u003ctd\u003eMailbox.org\u003c/td\u003e\n\u003ctd\u003e50?\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eGermany\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003eno?\u003c/td\u003e\n\u003ctd\u003eno\u003c/td\u003e\n\u003ctd\u003e\u003csup\u003e25\u003c/sup\u003e\u0026frasl;\u003csub\u003e50\u003c/sub\u003e\u003c/td\u003e\n\u003ctd\u003e10G\u003c/td\u003e\n\u003ctd\u003e3\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003emeta exposed, tracking\u003c/strong\u003e\u003c/td\u003e\n\u003c/tr\u003e\n\n\u003ctr\u003e\n\u003ctd\u003eRunbox - Mini\u003c/td\u003e\n\u003ctd\u003e5\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e\u003cspan class=\"underline\"\u003eNorway\u003c/span\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eno\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003eBTC\u003c/td\u003e\n\u003ctd\u003eno\u003c/td\u003e\n\u003ctd\u003e100\u003c/td\u003e\n\u003ctd\u003e10G\u003c/td\u003e\n\u003ctd\u003e2.91\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eno EAR\u003c/strong\u003e\u003c/td\u003e\n\u003c/tr\u003e\n\n\u003ctr\u003e\n\u003ctd\u003eProtonmail - Plus/Pro\u003c/td\u003e\n\u003ctd\u003e10/*1*\u003c/td\u003e\n\u003ctd\u003ebridge\u003c/td\u003e\n\u003ctd\u003e\u003cspan class=\"underline\"\u003eSwitzerland\u003c/span\u003e\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e5\u003c/td\u003e\n\u003ctd\u003e5G/5G\u003c/td\u003e\n\u003ctd\u003e\u003csup\u003e8\u003c/sup\u003e\u0026frasl;\u003csub\u003e5\u003c/sub\u003e\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003evisibility, suspicious\u003c/strong\u003e\u003c/td\u003e\n\u003c/tr\u003e\n\n\u003ctr\u003e\n\u003ctd\u003eMailfence - Pro/Entry\u003c/td\u003e\n\u003ctd\u003e\u003csup\u003e5\u003c/sup\u003e\u0026frasl;\u003csub\u003e1\u003c/sub\u003e\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eBelgium\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eno\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003eBTC/ \u003cspan class=\"underline\"\u003eLTC\u003c/span\u003e\u003c/td\u003e\n\u003ctd\u003eyes?\u003c/td\u003e\n\u003ctd\u003e\u003csup\u003e50\u003c/sup\u003e\u0026frasl;\u003csub\u003e10\u003c/sub\u003e\u003c/td\u003e\n\u003ctd\u003e20G/5G\u003c/td\u003e\n\u003ctd\u003e7.\u003csup\u003e5\u003c/sup\u003e\u0026frasl;\u003csub\u003e2\u003c/sub\u003e.5\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003enot EAR\u003c/strong\u003e\u003c/td\u003e\n\u003c/tr\u003e\n\n\u003ctr\u003e\n\u003ctd\u003ePosteo+\u003c/td\u003e\n\u003ctd\u003e0\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eGermany\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003eno\u003c/td\u003e\n\u003ctd\u003e?\u003c/td\u003e\n\u003ctd\u003e?\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eno domains\u003c/strong\u003e\u003c/td\u003e\n\u003c/tr\u003e\n\n\u003ctr\u003e\n\u003ctd\u003eCtemplar - Knight\u003c/td\u003e\n\u003ctd\u003e5\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eno\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cspan class=\"underline\"\u003eIceland\u003c/span\u003e\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e\u003cspan class=\"underline\"\u003eXMR\u003c/span\u003e /BTC\u003c/td\u003e\n\u003ctd\u003eyes?\u003c/td\u003e\n\u003ctd\u003e30\u003c/td\u003e\n\u003ctd\u003e10G\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003e12\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eno IMAP\u003c/strong\u003e\u003c/td\u003e\n\u003c/tr\u003e\n\n\u003ctr\u003e\n\u003ctd\u003eTutanota\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eno\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eGermany\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003eno\u003c/td\u003e\n\u003ctd\u003eyes\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eown encryption, no IMAP\u003c/strong\u003e\u003c/td\u003e\n\u003c/tr\u003e\n\n\u003ctr\u003e\n\u003ctd\u003eFastmail Standard\u003c/td\u003e\n\u003ctd\u003e100\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003cstrong\u003eAustralia\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003eno?\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e30G\u003c/td\u003e\n\u003ctd\u003e5\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003ctd\u003e\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\n\u003c/table\u003e\n\n\u003cp\u003ePersonally I liked Ctemplar, but I wanted IMAP since I use Emacs/mu4e for email\nmanagement and the possibility of keeping a local copy of my emails if needed.\nI also use my phone to read emails when needed. So I had to discard them.\nDepending on your use you may not need IMAP.\u003c/p\u003e\n\n\u003cp\u003eHonestly I am still not comfortable with my email provider, but I am better than\nat Google\u0026rsquo;s.\u003c/p\u003e\n\n\u003cp\u003eIn regards to usage, GPG is always preferred but of course it depends on both\nparties using it. Be mindful that RSA 2048 is no longer secure, governments can\nbreak into it. Probably not regular people. So I would go for 4096 bit keys.\u003c/p\u003e\n\n\u003cp\u003eI am not going to disclose publicly here what I use for security reasons. But if\nyou know me personally and have questions ask me one on one and I will share\nmore about this. I know that if you are a technical person you can find this\nyourself.\u003c/p\u003e\n\n\u003ch2 id=\"conferences\"\u003eConferences\u003c/h2\u003e\n\n\u003cp\u003eI don\u0026rsquo;t trust Zoom. Do your own research here. One of the founders was an\nex-Cisco systems. Again\u0026hellip; do your own research.\u003c/p\u003e\n\n\u003cp\u003eI would go for Jitsi or something is open source. Of course a case could be done\nthat there is always a server as middle man, to which yes, I agree. At this\npoint I don\u0026rsquo;t know of any better alternatives, Jitsi is the way I would go or\nSignal\u0026rsquo;s video chat feature. Even though I don\u0026rsquo;t trust much Signal either.\u003c/p\u003e\n\n\u003ch2 id=\"browsing\"\u003eBrowsing\u003c/h2\u003e\n\n\u003cp\u003eI don\u0026rsquo;t use Google Chrome, even less Microsoft Edge. I prefer the old Firefox.\u003c/p\u003e\n\n\u003cp\u003eAs part of my setup I don\u0026rsquo;t save cookies when I close the browser nor history. I\nalways prefer private mode when possible and I use a bunch of extensions to make\nmy unique fingerprint not so obvious.\u003c/p\u003e\n\n\u003cp\u003eI avoid using google whenever possible. I don\u0026rsquo;t trust much Duckduck go either.\nSearch engines are the gate keepers of the internet, sadly there is no integrity\nin this business. I have read good things about Qwant.\u003c/p\u003e\n\n\u003cp\u003eI would advice to also disable Javascript by default by using No Script or\nsimilar. As using other extensions to make your tracking less obvious, even\nthough I don\u0026rsquo;t think there is much to do here. Try to always use VPNs or TOR\ncircuits. Be aware that having a high level of privacy/security could make your\nbrowsing experience miserable!\u003c/p\u003e\n\n\u003ch2 id=\"money\"\u003eMoney\u003c/h2\u003e\n\n\u003cp\u003eWell, this is going to be controversial. We don\u0026rsquo;t use money, we use fiat\ncurrency which is controlled by the governments and manipulated via inflation\nand taxes as they want. It is hard to get out of that. Cash is always preferred\nbut it is not convenient, so balancing things out is up to the reader.\u003c/p\u003e\n\n\u003cp\u003ePrecious metals could be an alternative but probably everything is going to get\ndigitized in the future, even precious metals probably with certificates on the\nblockchain as Colombia is already issuing for real estate. So I don\u0026rsquo;t have good\nnews here.\u003c/p\u003e\n\n\u003cp\u003eProbably having some money in a private crypto currency like ZCash, Monero,\nVerge or others could be a good idea. Be mindful of the fluctuations and the\nrisks about it as the tax compliance.\u003c/p\u003e\n\n\u003cp\u003eAlso be mindful that you should aim for a peer to peer market and that could be\ndangerous also, so you will have to \u0026ldquo;trust\u0026rdquo; the network somehow. If you use an\nexchange it defeats the purpose of privacy.\u003c/p\u003e\n\n\u003cp\u003eIf you go for a private crypto, it is highly likely that you can run a local\nnode. You can use a small device for such like a Raspberry Pi or a refurbished\nmini-desktop or notebook. You will have to setup the service and get a full copy\nof the block chain.\u003c/p\u003e\n\n\u003cp\u003eHonestly I would hedge for land, food security and water rather than save money.\nBut that is just my opinion.\u003c/p\u003e\n\n\u003ch2 id=\"emergency-communications\"\u003eEmergency communications\u003c/h2\u003e\n\n\u003cp\u003eThis is going to be controversial also. I am still learning about radio but I\nwould definitively have a Ham radio and a rapport team, otherwise the radio\nalone is useless. Community is extremely important.\u003c/p\u003e\n\n\u003cp\u003eI prefer not to touch much on this subject. Do your own research. Maybe the\nGhost network could help you. Check out \u003ca href=\"https://www.youtube.com/watch?v=1oaWRs2te68\"\u003ethis video on the Lilygo T-Deck device\nwith the Meshtastic software for Encrypted Comms\u003c/a\u003e. And this video on \u003ca href=\"https://www.youtube.com/watch?v=EAQI2ZSmxPU\"\u003eMeshtastic\nand LoRa devices\u003c/a\u003e for general knowledge. I am fairly new to this, so do your\nown research. Not having to use a phone would be preferred IMO, so it is not\ntied to the IMEI number, MAC address, IP address and so forth.\u003c/p\u003e\n\n\u003ch2 id=\"conclusion-and-closing-remarks\"\u003eConclusion and closing remarks\u003c/h2\u003e\n\n\u003cp\u003eRemember, favor VPNs or TOR circuits, handle your secrets yourself in a secure\nand reliable way.\u003c/p\u003e\n\n\u003cp\u003eDon\u0026rsquo;t trust services where you need to supply personal data. Prefer services\nthat offer alternative payment methods in crypto also.\u003c/p\u003e\n\n\u003cp\u003eAs I said in the beginning, privacy and security is a rabbit hole that can go\nvery deep, even for the technical guy. So I am trying to just give an overview.\u003c/p\u003e\n\n\u003cp\u003eIf there is a category that I forgot about that you would like to see here, send\nme a message.\u003c/p\u003e\n\u003cdiv class=\"footnotes\"\u003e\n\n\u003chr /\u003e\n\n\u003col\u003e\n\u003cli id=\"fn:fn-1\"\u003e\u003cp\u003eFor more on these \u0026ldquo;eyes\u0026rdquo; I suggest you to read: \u0026ldquo;Permanent record\u0026rdquo; by\nEdward Snowden and/or \u0026ldquo;No place to hide\u0026rdquo; by Gleen Greenwald.\u003c/p\u003e\n \u003ca class=\"footnote-return\" href=\"#fnref:fn-1\"\u003e\u003csup\u003e[return]\u003c/sup\u003e\u003c/a\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\u003c/div\u003e\n","text":" A good friend of mine motivated me to write down this post. I am not sure how I am going to address this in a \u0026ldquo;short\u0026rdquo; way since security and privacy is such a vast topic. It can be taken to several levels also, so it is a matter of how you actually compromise in favor of being usable and practical, since the power in place make it difficult on purpose to have open alternatives that work.\nI am going to do my best to divide this in different topics, keep it short and non-technical. It is going to be challenging.\nDesktop GNU/Linux is definitively the way to go. Personally I don\u0026rsquo;t trust Microsoft nor Apple. In general I am an advocate of open source.\nPersonally I have been using GNU/Linux since around 2000, and I am extremely comfortable with it. I understand that it could be a challenge where we still don\u0026rsquo;t have alternatives (or high quality tools) to some specific software like CAD. But at the same time Linux have better tools in many other aspects.\nThere are different \u0026ldquo;distros\u0026rdquo; of GNU/Linux. A distro (or distribution) is the mixture of the tools from GNU, the Linux kernel and a way to manage packages. This is a very simplistic definition, but I don\u0026rsquo;t want to get too technical here.\nDistributions for the beginners:\n Ubuntu OpenSuSE Fedora Linux Mint (never tried it) Manjaro (never tried it)  Distributions for more mature users:\n Debian Arch Linux Gentoo (never tried it)  Mobile Between IPhone and Android, I will always chose Android. The reason being that Android has a hybrid open/close source development model. It is possible to get the Vanilla version of Android without google play (actually nothing from google) and then you can install an alternative to google play like F-Droid or Aurora Store.\nI don\u0026rsquo;t completely trust Aurora Store because it is a front end of Google Play itself, and software could have backdoors but I still think it could be a better alternative than have a phone that you paid for but Google owns.\nJust like GNU/Linux, there are several distros. These can com \u0026ldquo;with gapps\u0026rdquo; or \u0026ldquo;without gapps\u0026rdquo;. Gapps being \u0026ldquo;Google Apps\u0026rdquo;, in other words, Google Play, Gmail, Google maps, etc. Without gapps is the way I prefer to go personally.\nThere are several custom roms like:\n Lineage Resurrection Remix CalyxOS GrapheneOS  The most secure focus are Graphene and Calyx. Again, privacy and security is a deep rabbit hole. As deep as you can afford to go.\nPersonally I have been using Lineage for years and some custom mods. Every single Android device that I owned, I flashed and removed the original Android and replace it with a custom rom without Google Apps (nothing from Google). I have been doing this since around 2006. I am very curious to try Calyx though. If I would be starting from scratch, I would go for Calyx.\nI have a Mediatek chipset on my phone and I hated it! That was definetively a bad purchase for this purposes. Don\u0026rsquo;t get me wrong, the phone is great, but it is not easier to flash a custom ROM. I would go for Qualcomm chipset instead and make sure that the bootloader can be changed. This Ulefone Armor 23 looks promising. Apparently the 24 will also come with a Qualcom chipset.\nNetwork When in doubt, use a VPN or TOR circuits. In this way your traffic remains more secure. You can get a router that has that capability already built in, so you can route everything through that device.\nAlways use a firewall and disable the services you don\u0026rsquo;t use. Use strong passwords.\nIf you are looking for an appliance that can do all of that you will need DD-WRT, pfSense or similar if you want a DIY approach and you are techie enough or go for a similar commercial solution like the BraxRouter (I am not affiliated in any way, and I haven\u0026rsquo;t tested it personally so be cautious and do your own research - DYOR).\nAuthentication I prefer avoiding using SMS authentication, I don\u0026rsquo;t trust the telephony system. They have too much power and knowledge about their users.\nI also avoid the Google prompts. Those who appears when you are trying to login on your phone while you are trying to login on your computer. The reason is simple, they tie your identity on the computer with your phone, because you will have to \u0026ldquo;click\u0026rdquo; on your phone. All traffic will be related.\nI don\u0026rsquo;t use Google Authenticator nor Authy, or any Android app for that matter unless it is opensource. Personally I use one on my computer, this brings extra security and inconveniences. If I am not with my computer, I cannot login anywhere, even with my phone. I decided to live with that inconvenience.\nUse 2FA (Second Factor Authentication) whenever possible, but with OTP (One TIme Password) for that. I prefer free TOTP software, the caveat to this approach is that you will have to handle your secrets yourself in a secure way, so you don\u0026rsquo;t lose them and nobody else has access to them. Please don\u0026rsquo;t even think about putting that into Dropbox!\nI am a fairly technical guy so I prefer to keep the secrets under my control having encrypted backups than \u0026ldquo;trusting\u0026rdquo; any other party.\nI am not going to disclose publicly here what I use for security reasons. But if you know me personally and have questions ask me one on one and I will share more about this.\nIf you want more information, do your own research. I can point you to this video, as a quick overview. I think the title is a bit missleading though, I trust 2FA with TOTP where the secrets are encrypted and properly backed up.\nIM communications Signal or no signal\u0026hellip; that is the question\u0026hellip;\nI have been a huge fan of Telegram. At the beginning, you did not needed to use a phone number, it was just an account you created (and you could create as many as you wanted) and that was it. No verification and no ties to your identity. Sadly, now they \u0026ldquo;require\u0026rdquo; a phone number, which is by design IMO. So I no longer trust Telegram. The same argument goes for Signal.\nI am aware of Signal\u0026rsquo;s history, even before it was signal and the original developers, but again\u0026hellip; I don\u0026rsquo;t trust supplying my phone number to any app for any reason. There is no need for that, none.\nI have always hated Whatsapp, security is crappy, it belongs to Meta. Huge user base\u0026hellip; So many reasons that I wont even go there\u0026hellip;\nMy preferred method for IM is XMPP which is federated in nature, so \u0026ldquo;no central points\u0026rdquo; (again, loosely said). I would prefer to pick up a server that is not crowded, it is in a country outside of the 5 eyes\u0026nbsp;1.\nIn terms of privacy, OMEMO would be preferred, or asymmetric cryptography with GPG/PGP, or OTR (Off The Record) to say the least.\nEmail communications This is a topic that I struggled with for some time.\nBottom line is I don\u0026rsquo;t trust large providers, because they are an easy target. Out\nI wrote a note, which is not publicly available analyzing the email providers by April of 2022. Before that I was using a really old google apps account that I created around 2005. It was very convenient, I am not going to lie, but I never felt good about it so it was good that Google decided to kick me out by charging me. If I have to pay, I prefer to pay for something more friendly towards privacy than to them.\nHere is a table with a summary of some of the criteria that I used to analyze those providers.\n   Provider Domains IMAP Location EAR Crypto pay App Alias Storage Price/m 2FA Cons     CounterMail 15$ yes Sweden yes BTC no inf 4G ~5 yes sweden   Mailbox.org 50? yes Germany yes no? no 25\u0026frasl;50 10G 3 yes meta exposed, tracking   Runbox - Mini 5 yes Norway no BTC no 100 10G 2.91  no EAR   Protonmail - Plus/Pro 10/*1* bridge Switzerland yes  yes 5 5G/5G 8\u0026frasl;5  visibility, suspicious   Mailfence - Pro/Entry 5\u0026frasl;1 yes Belgium no BTC/ LTC yes? 50\u0026frasl;10 20G/5G 7.5\u0026frasl;2.5  not EAR   Posteo+ 0 yes Germany yes no ? ?    no domains   Ctemplar - Knight 5 no Iceland yes XMR /BTC yes? 30 10G 12 yes no IMAP   Tutanota  no Germany yes no yes     own encryption, no IMAP   Fastmail Standard 100  Australia  no?   30G 5      Personally I liked Ctemplar, but I wanted IMAP since I use Emacs/mu4e for email management and the possibility of keeping a local copy of my emails if needed. I also use my phone to read emails when needed. So I had to discard them. Depending on your use you may not need IMAP.\nHonestly I am still not comfortable with my email provider, but I am better than at Google\u0026rsquo;s.\nIn regards to usage, GPG is always preferred but of course it depends on both parties using it. Be mindful that RSA 2048 is no longer secure, governments can break into it. Probably not regular people. So I would go for 4096 bit keys.\nI am not going to disclose publicly here what I use for security reasons. But if you know me personally and have questions ask me one on one and I will share more about this. I know that if you are a technical person you can find this yourself.\nConferences I don\u0026rsquo;t trust Zoom. Do your own research here. One of the founders was an ex-Cisco systems. Again\u0026hellip; do your own research.\nI would go for Jitsi or something is open source. Of course a case could be done that there is always a server as middle man, to which yes, I agree. At this point I don\u0026rsquo;t know of any better alternatives, Jitsi is the way I would go or Signal\u0026rsquo;s video chat feature. Even though I don\u0026rsquo;t trust much Signal either.\nBrowsing I don\u0026rsquo;t use Google Chrome, even less Microsoft Edge. I prefer the old Firefox.\nAs part of my setup I don\u0026rsquo;t save cookies when I close the browser nor history. I always prefer private mode when possible and I use a bunch of extensions to make my unique fingerprint not so obvious.\nI avoid using google whenever possible. I don\u0026rsquo;t trust much Duckduck go either. Search engines are the gate keepers of the internet, sadly there is no integrity in this business. I have read good things about Qwant.\nI would advice to also disable Javascript by default by using No Script or similar. As using other extensions to make your tracking less obvious, even though I don\u0026rsquo;t think there is much to do here. Try to always use VPNs or TOR circuits. Be aware that having a high level of privacy/security could make your browsing experience miserable!\nMoney Well, this is going to be controversial. We don\u0026rsquo;t use money, we use fiat currency which is controlled by the governments and manipulated via inflation and taxes as they want. It is hard to get out of that. Cash is always preferred but it is not convenient, so balancing things out is up to the reader.\nPrecious metals could be an alternative but probably everything is going to get digitized in the future, even precious metals probably with certificates on the blockchain as Colombia is already issuing for real estate. So I don\u0026rsquo;t have good news here.\nProbably having some money in a private crypto currency like ZCash, Monero, Verge or others could be a good idea. Be mindful of the fluctuations and the risks about it as the tax compliance.\nAlso be mindful that you should aim for a peer to peer market and that could be dangerous also, so you will have to \u0026ldquo;trust\u0026rdquo; the network somehow. If you use an exchange it defeats the purpose of privacy.\nIf you go for a private crypto, it is highly likely that you can run a local node. You can use a small device for such like a Raspberry Pi or a refurbished mini-desktop or notebook. You will have to setup the service and get a full copy of the block chain.\nHonestly I would hedge for land, food security and water rather than save money. But that is just my opinion.\nEmergency communications This is going to be controversial also. I am still learning about radio but I would definitively have a Ham radio and a rapport team, otherwise the radio alone is useless. Community is extremely important.\nI prefer not to touch much on this subject. Do your own research. Maybe the Ghost network could help you. Check out this video on the Lilygo T-Deck device with the Meshtastic software for Encrypted Comms. And this video on Meshtastic and LoRa devices for general knowledge. I am fairly new to this, so do your own research. Not having to use a phone would be preferred IMO, so it is not tied to the IMEI number, MAC address, IP address and so forth.\nConclusion and closing remarks Remember, favor VPNs or TOR circuits, handle your secrets yourself in a secure and reliable way.\nDon\u0026rsquo;t trust services where you need to supply personal data. Prefer services that offer alternative payment methods in crypto also.\nAs I said in the beginning, privacy and security is a rabbit hole that can go very deep, even for the technical guy. So I am trying to just give an overview.\nIf there is a category that I forgot about that you would like to see here, send me a message.\n For more on these \u0026ldquo;eyes\u0026rdquo; I suggest you to read: \u0026ldquo;Permanent record\u0026rdquo; by Edward Snowden and/or \u0026ldquo;No place to hide\u0026rdquo; by Gleen Greenwald.\n[return]   "},"name":"My thoughts on privacy and security","published":"2023-12-10T09:46:33-03:00","summary":"A good friend of mine motivated me to write down this post. I am not sure how I am going to address this in a \u0026ldquo;short\u0026rdquo; way since security and privacy is such a vast topic. It can be taken to several levels also, so it is a matter of how you actually compromise in favor of being usable and practical, since the power in place make it difficult on purpose to have open alternatives that work.","type":"entry","url":"https://albertdelafuente.com/posts/privacy/"}],"name":"privacy","type":"feed","url":"https://albertdelafuente.com/tags/privacy/"}