{"author":{"name":"Albert","type":"card","url":"https://albertdelafuente.com"},"content":{"html":"\n\n\u003cdiv class=\"ox-hugo-toc toc\"\u003e\n\u003cdiv\u003e\u003c/div\u003e\n\n\u003cdiv class=\"heading\"\u003eTable of Contents\u003c/div\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"#8-common-patterns-in-trauma-bonded-relationships-youtube\"\u003e8 common patterns in trauma bonded relationships - YouTube\u003c/a\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"#1--justification\"\u003e(1) Justification\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#2--believing-the-future-faking\"\u003e(2) Believing the future faking\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#3--keep-having-the-same-fight-over-and-over--repetition-compulsion\"\u003e(3) Keep having the same fight over and over (repetition compulsion)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#4--not-able-to-give-clear-reasons-on-staying-in-the-relationship\"\u003e(4) Not able to give clear reasons on staying in the relationship\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#5--fear-of-leaving\"\u003e(5) Fear of leaving\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#6--becoming-a-one-stop-shop-for-your-partner\"\u003e(6) Becoming a one-stop-shop for your partner\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#7--hiding-your-feeling-and-needs\"\u003e(7) Hiding your feeling and needs\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#8--rationalizing-the-relationship-to-other-people-or-hiding-the-pattern-from-others\"\u003e(8) Rationalizing the relationship to other people or hiding the pattern from others\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#can-this-change\"\u003eCan this change?\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003c/div\u003e\n\u003c!--endtoc--\u003e\u003c/p\u003e\n\n\u003ch2 id=\"8-common-patterns-in-trauma-bonded-relationships-youtube\"\u003e\u003ca href=\"https://www.youtube.com/watch?v=yH-H4PkoH88\"\u003e8 common patterns in trauma bonded relationships - YouTube\u003c/a\u003e\u003c/h2\u003e\n\n\u003cul\u003e\n\u003cli\u003eSource: \u003ca href=\"https://www.youtube.com/watch?v=yH-H4PkoH88\"\u003ehttps://www.youtube.com/watch?v=yH-H4PkoH88\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eTitle: 8 common patterns in trauma bonded relationships - YouTube\u003c/li\u003e\n\u003cli\u003eCaptured on: \u003cspan class=\"timestamp-wrapper\"\u003e\u003cspan class=\"timestamp\"\u003e[2021-03-27 Sat]\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eResearch more on \u0026ldquo;trauma bonded relationships\u0026rdquo;, that is the term\u003c/p\u003e\n\n\u003cp\u003eTrauma bonded relationships are a form of indoctrination similar to a cult.\nThe way a cult keeps people around is by creating fear of what is outside in the unknown\u003c/p\u003e\n\n\u003ch3 id=\"1--justification\"\u003e(1) Justification\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eThey don\u0026rsquo;t mean it\u003c/li\u003e\n\u003cli\u003eMy parent had a tough childhood\u003c/li\u003e\n\u003cli\u003eStarts in childhood trying to justify parent\u0026rsquo;s abuse\u003c/li\u003e\n\u003cli\u003eIt becomes a reflexive pattern in adults\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"2--believing-the-future-faking\"\u003e(2) Believing the future faking\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eI will go to the doctor\u003c/li\u003e\n\u003cli\u003eI am going to get therapy / I am going to work on myself\u003c/li\u003e\n\u003cli\u003eIt never happens in a substantial way, and you get trapped\u003c/li\u003e\n\u003cli\u003eEmpats want to believe and will get hanged to any branch that brings hope\u003c/li\u003e\n\u003cli\u003eThe person lives in the hope, but never in the reality\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"3--keep-having-the-same-fight-over-and-over--repetition-compulsion\"\u003e(3) Keep having the same fight over and over (repetition compulsion)\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eIt can be about money\u003c/li\u003e\n\u003cli\u003eOr not spending enough time together\u003c/li\u003e\n\u003cli\u003eAbout your respectives families\u003c/li\u003e\n\u003cli\u003eSame fights every holiday season\u003c/li\u003e\n\u003cli\u003eSame fight over and over with no resolution\u003c/li\u003e\n\u003cli\u003eNarcs have no intention on changing\u003c/li\u003e\n\u003cli\u003eShows lacks of empathy or growth on narcs\u003c/li\u003e\n\u003cli\u003eEmpats are having the same argument with hope of change\u003c/li\u003e\n\u003cli\u003eToxic personalities are really tough and do not change\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"4--not-able-to-give-clear-reasons-on-staying-in-the-relationship\"\u003e(4) Not able to give clear reasons on staying in the relationship\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eIt is \u0026ldquo;something\u0026rdquo;\u003c/li\u003e\n\u003cli\u003eMagical justification\u003c/li\u003e\n\u003cli\u003eYou should be looking for hard and heavy stuff: Respect, kindness, compassion, mutuality, reciprocity, empathy, growth\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"5--fear-of-leaving\"\u003e(5) Fear of leaving\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eOnce the empat recognize it, and wants to leave, a fear overcomes him\u003c/li\u003e\n\u003cli\u003eThe most common themes are: Self doubt, \u0026ldquo;what if I am wrong\u0026rdquo;\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"6--becoming-a-one-stop-shop-for-your-partner\"\u003e(6) Becoming a one-stop-shop for your partner\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u0026ldquo;If I do enough for them, they will be happy\u0026rdquo;. No they will never be happy, because they are not capable\u003c/li\u003e\n\u003cli\u003eBecoming a personal assistant with many roles like:\n\n\u003cul\u003e\n\u003cli\u003eParent\u003c/li\u003e\n\u003cli\u003eChef\u003c/li\u003e\n\u003cli\u003eHome assistant\u003c/li\u003e\n\u003cli\u003eCheerleader\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"7--hiding-your-feeling-and-needs\"\u003e(7) Hiding your feeling and needs\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003eYou do not feel that you can share your needs\u003c/li\u003e\n\u003cli\u003eIt is true, you can\u0026rsquo;t share without getting hurt\u003c/li\u003e\n\u003cli\u003eThis pattern is not about survival, but self devaluation and fear of upsetting the narc\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"8--rationalizing-the-relationship-to-other-people-or-hiding-the-pattern-from-others\"\u003e(8) Rationalizing the relationship to other people or hiding the pattern from others\u003c/h3\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u0026ldquo;That is normal, right\u0026rdquo;\u003c/li\u003e\n\u003cli\u003eThere is a lot of shame, so it is not possible for an empat to talk to others about the relationship in happy terms\u003c/li\u003e\n\u003cli\u003eAn empat can describe the relationship as good, and talk about the future fake stuff as it is real\u003c/li\u003e\n\u003cli\u003eHide the unconfortable stuff or be very vague when talking about the relationship\u003c/li\u003e\n\u003cli\u003eMany empats do not get the support needed since they are offering a \u0026ldquo;good picture\u0026rdquo; of their lives\u003c/li\u003e\n\u003cli\u003eThey might not be hearing the dissenting voices, empats are stuck! The patterns of justifications keep going\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2 id=\"can-this-change\"\u003eCan this change?\u003c/h2\u003e\n\n\u003cul\u003e\n\u003cli\u003eIt is very effortful for this to change\u003c/li\u003e\n\u003cli\u003eThis is why when the empat meets a person that is calm, stable and without drama they might \u0026ldquo;not have a connection\u0026rdquo;\u003c/li\u003e\n\u003cli\u003eThe absence of chaos is not recognized as normal. It takes a while to let go those patterns of childhood:\n\n\u003cul\u003e\n\u003cli\u003eDrama = love\u003c/li\u003e\n\u003cli\u003eAbuse = love\u003c/li\u003e\n\u003cli\u003eInvalidation = love\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003eIt requires to understand the architecture of these relationship and yourself\u003c/li\u003e\n\u003cli\u003eThere is so much shame and subsequent self-blame\n\n\u003cul\u003e\n\u003cli\u003eIt is not your fault, it is not understanding it\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003eOnce you understand it, you can change\u003c/li\u003e\n\u003c/ul\u003e\n","text":"  Table of Contents  8 common patterns in trauma bonded relationships - YouTube  (1) Justification (2) Believing the future faking (3) Keep having the same fight over and over (repetition compulsion) (4) Not able to give clear reasons on staying in the relationship (5) Fear of leaving (6) Becoming a one-stop-shop for your partner (7) Hiding your feeling and needs (8) Rationalizing the relationship to other people or hiding the pattern from others  Can this change?   \n8 common patterns in trauma bonded relationships - YouTube  Source: https://www.youtube.com/watch?v=yH-H4PkoH88 Title: 8 common patterns in trauma bonded relationships - YouTube Captured on: [2021-03-27 Sat]  Research more on \u0026ldquo;trauma bonded relationships\u0026rdquo;, that is the term\nTrauma bonded relationships are a form of indoctrination similar to a cult. The way a cult keeps people around is by creating fear of what is outside in the unknown\n(1) Justification  They don\u0026rsquo;t mean it My parent had a tough childhood Starts in childhood trying to justify parent\u0026rsquo;s abuse It becomes a reflexive pattern in adults  (2) Believing the future faking  I will go to the doctor I am going to get therapy / I am going to work on myself It never happens in a substantial way, and you get trapped Empats want to believe and will get hanged to any branch that brings hope The person lives in the hope, but never in the reality  (3) Keep having the same fight over and over (repetition compulsion)  It can be about money Or not spending enough time together About your respectives families Same fights every holiday season Same fight over and over with no resolution Narcs have no intention on changing Shows lacks of empathy or growth on narcs Empats are having the same argument with hope of change Toxic personalities are really tough and do not change  (4) Not able to give clear reasons on staying in the relationship  It is \u0026ldquo;something\u0026rdquo; Magical justification You should be looking for hard and heavy stuff: Respect, kindness, compassion, mutuality, reciprocity, empathy, growth  (5) Fear of leaving  Once the empat recognize it, and wants to leave, a fear overcomes him The most common themes are: Self doubt, \u0026ldquo;what if I am wrong\u0026rdquo;  (6) Becoming a one-stop-shop for your partner  \u0026ldquo;If I do enough for them, they will be happy\u0026rdquo;. No they will never be happy, because they are not capable Becoming a personal assistant with many roles like:  Parent Chef Home assistant Cheerleader   (7) Hiding your feeling and needs  You do not feel that you can share your needs It is true, you can\u0026rsquo;t share without getting hurt This pattern is not about survival, but self devaluation and fear of upsetting the narc  (8) Rationalizing the relationship to other people or hiding the pattern from others  \u0026ldquo;That is normal, right\u0026rdquo; There is a lot of shame, so it is not possible for an empat to talk to others about the relationship in happy terms An empat can describe the relationship as good, and talk about the future fake stuff as it is real Hide the unconfortable stuff or be very vague when talking about the relationship Many empats do not get the support needed since they are offering a \u0026ldquo;good picture\u0026rdquo; of their lives They might not be hearing the dissenting voices, empats are stuck! The patterns of justifications keep going  Can this change?  It is very effortful for this to change This is why when the empat meets a person that is calm, stable and without drama they might \u0026ldquo;not have a connection\u0026rdquo; The absence of chaos is not recognized as normal. It takes a while to let go those patterns of childhood:  Drama = love Abuse = love Invalidation = love  It requires to understand the architecture of these relationship and yourself There is so much shame and subsequent self-blame  It is not your fault, it is not understanding it  Once you understand it, you can change  "},"name":"Video notes: 8 common patterns in trauma bonded relationships","published":"2021-03-27T00:00:00-03:00","summary":"Table of Contents  8 common patterns in trauma bonded relationships - YouTube  (1) Justification (2) Believing the future faking (3) Keep having the same fight over and over (repetition compulsion) (4) Not able to give clear reasons on staying in the relationship (5) Fear of leaving (6) Becoming a one-stop-shop for your partner (7) Hiding your feeling and needs (8) Rationalizing the relationship to other people or hiding the pattern from others  Can this change?","type":"entry","url":"https://albertdelafuente.com/exobrain/20210327145900-video_notes_8_common_patterns_in_trauma_bonded_relationships/"}