{"author":{"name":"Albert","type":"card","url":"https://albertdelafuente.com"},"content":{"html":"\u003cp\u003eThanks for visiting my website. My name is Albert. I don\u0026rsquo;t like to describe\nmyself\u0026hellip; If you landed here probably you can make your own picture of me. You\nwill anyway\u0026hellip;\u003c/p\u003e\n\n\u003cp\u003eI like Free Software, coding and distributed systems. My academic interests are:\ncloud computing, virtualization, optimization, swarm intelligence, artificial\nintelligence. Here are some of my \u003ca href=\"https://scholar.google.com/citations?user=GlGFnPIAAAAJ\u0026amp;hl=en\"\u003epublications\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eI am very curious by nature and feel attracted to: math, music, languages,\ngenerative art, fractals, self-reliance, survival, beekeeping, photography\u0026hellip; I\nlove to read and learn new things, travel, solve problems and understand how\nthings work.\u003c/p\u003e\n\n\u003cp\u003eI love languages but have a difficult time learning grammar and the\n\u0026ldquo;conventional way\u0026rdquo;. I am very curious about Hebrew, specially the early\npictographic Hebrew. I believe in Yeshua, the Torah and the prophets. No, I am\nnot jew.\u003c/p\u003e\n\n\u003cp\u003eI use Arch Linux, Emacs, Org-roam and Python as my EDC stack. I have shared some\nof my notes on the \u003ca href=\"http://albertdelafuente.com/exobrain/\"\u003eexobrain section\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eMy GPG key fingerprint is \u003ca href=\"https://keybase.io/vonpupp/key.asc\"\u003e\u003ccode\u003e5368 14BF 4871 A220\u003c/code\u003e\u003c/a\u003e. Feel free to send me an email\nto the address: \u003ccode\u003email at this domain\u003c/code\u003e\u003c/p\u003e\n\n\u003cp\u003eIf you made it this far. Thanks for reading.\u003c/p\u003e\n","text":"Thanks for visiting my website. My name is Albert. I don\u0026rsquo;t like to describe myself\u0026hellip; If you landed here probably you can make your own picture of me. You will anyway\u0026hellip;\nI like Free Software, coding and distributed systems. My academic interests are: cloud computing, virtualization, optimization, swarm intelligence, artificial intelligence. Here are some of my publications.\nI am very curious by nature and feel attracted to: math, music, languages, generative art, fractals, self-reliance, survival, beekeeping, photography\u0026hellip; I love to read and learn new things, travel, solve problems and understand how things work.\nI love languages but have a difficult time learning grammar and the \u0026ldquo;conventional way\u0026rdquo;. I am very curious about Hebrew, specially the early pictographic Hebrew. I believe in Yeshua, the Torah and the prophets. No, I am not jew.\nI use Arch Linux, Emacs, Org-roam and Python as my EDC stack. I have shared some of my notes on the exobrain section.\nMy GPG key fingerprint is 5368 14BF 4871 A220. Feel free to send me an email to the address: mail at this domain\nIf you made it this far. Thanks for reading.\n"},"name":"About me","published":"2020-08-17T00:00:00-03:00","summary":"Thanks for visiting my website. My name is Albert. I don\u0026rsquo;t like to describe myself\u0026hellip; If you landed here probably you can make your own picture of me. You will anyway\u0026hellip;\nI like Free Software, coding and distributed systems. My academic interests are: cloud computing, virtualization, optimization, swarm intelligence, artificial intelligence. Here are some of my publications.\nI am very curious by nature and feel attracted to: math, music, languages, generative art, fractals, self-reliance, survival, beekeeping, photography\u0026hellip; I love to read and learn new things, travel, solve problems and understand how things work.","type":"entry","url":"https://albertdelafuente.com/about/about/"}