{"author":{"name":"Albert","type":"card","url":"https://albertdelafuente.com"},"content":{"html":"\u003cp\u003eThanks for visiting my website. My name is Albert. I don\u0026rsquo;t like to describe\nmyself\u0026hellip; If you landed here probably you can make your own picture of myself.\nYou will anyway\u0026hellip;\u003c/p\u003e\n\u003cp\u003eI like Free Software, coding and distributed systems. My academic interests are:\ncloud computing, virtualization, optimization, swarm intelligence, artificial\nintelligence. Here are some of my \u003ca href=\"https://scholar.google.com/citations?user=GlGFnPIAAAAJ\u0026amp;hl=en\"\u003epublications\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eI also have interest and curiosity in other fields like: music, languages,\narchaeology, self-reliance, survival, agro-ecology, beekeeping. I am very\ncurious by nature.\u003c/p\u003e\n\u003cp\u003eI am honored and humbled to be a polyglot. I speak English, Spanish, French and\nPortuguese.  I understand some basic Italian. I am striving to learn Hebrew (not\nan easy task), I am particularly interested in Proto-Sinaitic Hebrew. I also\nwould like to learn Morse code.\u003c/p\u003e\n\u003cp\u003eAmong my hobbies and likes are: reading, music, \u003cdel\u003etraveling\u003c/del\u003e (removed due to\nrecent events), math, solving problems, to understand how things work and\nphotography.\u003c/p\u003e\n\u003cp\u003eI heavily prefer Linux based OS. Currently I use Arch Linux as my desktop distro\nof choice.  I take lots and lots of notes, it is part of my way of thinking. I\nhave an exobrain with +9K nodes. A little few are shared on the \u003ca href=\"http://albertdelafuente.com/exobrain/\"\u003eexobrain\nsection\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eI had the pleasure to meet very interesting minds like: The Linux kernel creator\nLinus Torvalds (at a LinuxCon in 2011). The GNU project creator Richard\nStallman. One of the authors of the book Design Patterns: Elements of Reusable\nObject-Oriented Software, Ralph Johnson; among others.\u003c/p\u003e\n\u003cp\u003eI am more than privileged to be a believer in YHWH Elohim, the Eternal Torah as\nHis Word and Yeshua the Messiah as The Example to follow. I do not follow\njudaism nor christianity practices nor man made traditions. I am just interested\nin following THE WAY.\u003c/p\u003e\n\u003cp\u003eMy GPG key fingerprint is \u003ca href=\"https://keybase.io/vonpupp/key.asc\"\u003e\u003ccode\u003e5368 14BF 4871 A220\u003c/code\u003e\u003c/a\u003e. Feel free to send me an email\nto the address: \u003ccode\u003email at this domain\u003c/code\u003e\u003c/p\u003e\n\u003cp\u003eI think that is enough for a description. If you made it here, thanks for reading.\u003c/p\u003e\n","text":"Thanks for visiting my website. My name is Albert. I don\u0026rsquo;t like to describe myself\u0026hellip; If you landed here probably you can make your own picture of myself. You will anyway\u0026hellip;\nI like Free Software, coding and distributed systems. My academic interests are: cloud computing, virtualization, optimization, swarm intelligence, artificial intelligence. Here are some of my publications.\nI also have interest and curiosity in other fields like: music, languages, archaeology, self-reliance, survival, agro-ecology, beekeeping. I am very curious by nature.\nI am honored and humbled to be a polyglot. I speak English, Spanish, French and Portuguese. I understand some basic Italian. I am striving to learn Hebrew (not an easy task), I am particularly interested in Proto-Sinaitic Hebrew. I also would like to learn Morse code.\nAmong my hobbies and likes are: reading, music, traveling (removed due to recent events), math, solving problems, to understand how things work and photography.\nI heavily prefer Linux based OS. Currently I use Arch Linux as my desktop distro of choice. I take lots and lots of notes, it is part of my way of thinking. I have an exobrain with +9K nodes. A little few are shared on the exobrain section.\nI had the pleasure to meet very interesting minds like: The Linux kernel creator Linus Torvalds (at a LinuxCon in 2011). The GNU project creator Richard Stallman. One of the authors of the book Design Patterns: Elements of Reusable Object-Oriented Software, Ralph Johnson; among others.\nI am more than privileged to be a believer in YHWH Elohim, the Eternal Torah as His Word and Yeshua the Messiah as The Example to follow. I do not follow judaism nor christianity practices nor man made traditions. I am just interested in following THE WAY.\nMy GPG key fingerprint is 5368 14BF 4871 A220. Feel free to send me an email to the address: mail at this domain\nI think that is enough for a description. If you made it here, thanks for reading.\n"},"name":"About me","published":"2020-08-17T00:00:00Z","summary":"Thanks for visiting my website. My name is Albert. I don\u0026rsquo;t like to describe myself\u0026hellip; If you landed here probably you can make your own picture of myself. You will anyway\u0026hellip;\nI like Free Software, coding and distributed systems. My academic interests are: cloud computing, virtualization, optimization, swarm intelligence, artificial intelligence. Here are some of my publications.\nI also have interest and curiosity in other fields like: music, languages, archaeology, self-reliance, survival, agro-ecology, beekeeping.","type":"entry","url":"https://albertdelafuente.com/about/about-me/"}