{"author":{"name":"Albert","type":"card","url":"https://albertdelafuente.com"},"content":{"html":"\n\n\u003cdiv class=\"ox-hugo-toc toc\"\u003e\n\u003cdiv\u003e\u003c/div\u003e\n\n\u003cdiv class=\"heading\"\u003eTable of Contents\u003c/div\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"#parasha-miketz-מקץ-from-the-end\"\u003eParasha Miketz / מקץ / From the End\u003c/a\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"#torah\"\u003eTorah\u003c/a\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"#genesis-41-1-44-17-text-esv-wlc-audio-esv\"\u003eGenesis 41:1 - 44:17 | Text:ESV;WLC | Audio:ESV\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#haftarah\"\u003eHaftarah\u003c/a\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"#isaiah-61-1-3-text-esv-wlc-audio-esv\"\u003eIsaiah 61:1-3 | Text:ESV;WLC | Audio:ESV\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#zechariah-3-1-4-7-text-esv-wlc-audio-esv\"\u003eZechariah 3:1 - 4:7 | Text:ESV;WLC | Audio:ESV\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#brit-hadasha\"\u003eBrit Hadasha\u003c/a\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"#luke-4-16-30-text-esv-hhh-audio-esv\"\u003eLuke 4:16-30 | Text:ESV;HHH | Audio:ESV\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#acts-7-11-12-text-esv-hhh-audio-esv\"\u003eActs 7:11-12 | Text:ESV;HHH | Audio:ESV\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#1-corinthians-2-1-5-text-esv-hhh-audio-esv\"\u003e1 Corinthians 2:1-5 | Text:ESV;HHH | Audio:ESV\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#2020-notes\"\u003e2020 notes\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003c/div\u003e\n\u003c!--endtoc--\u003e\u003c/p\u003e\n\n\u003cp\u003eIMAGE\nPRIOR | NEXT\u003c/p\u003e\n\n\u003ch2 id=\"parasha-miketz-מקץ-from-the-end\"\u003eParasha Miketz / מקץ / From the End\u003c/h2\u003e\n\n\u003ch3 id=\"torah\"\u003eTorah\u003c/h3\u003e\n\n\u003ch4 id=\"genesis-41-1-44-17-text-esv-wlc-audio-esv\"\u003eGenesis 41:1 - 44:17 | \u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV%3BWLC\"\u003eText:ESV;WLC\u003c/a\u003e | \u003ca href=\"http://audio.esvonline.org/hw/01041001-01044017\"\u003eAudio:ESV\u003c/a\u003e\u003c/h4\u003e\n\n\u003cp\u003eEnglish Standard Version (ESV) \u003cbr /\u003e\n\u003cbr /\u003e\u003c/p\u003e\n\n\u003cp\u003e[[\u003ca href=\"http://audio.esvonline.org/hw/01041001-01044017\"\u003efile:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png\u003c/a\u003e]]\u003cbr /\u003e\u003c/p\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eJoseph Interprets Pharaoh\u0026rsquo;s Dreams\u003c/p\u003e\n\n\u003cp\u003e*41* After two whole years, Pharaoh dreamed that he was standing by the\nNile, ^{2 }and behold, there came up out of the Nile seven cows\nattractive and plump, and they fed in the reed grass. ^{3 }And behold,\nseven other cows, ugly and thin, came up out of the Nile after them, and\nstood by the other cows on the bank of the Nile. ^{4 }And the ugly, thin\ncows ate up the seven attractive, plump cows. And Pharaoh awoke.\n^{5 }And he fell asleep and dreamed a second time. And behold, seven\nears of grain, plump and good, were growing on one stalk. ^{6 }And\nbehold, after them sprouted seven ears, thin and blighted by the east\nwind. ^{7 }And the thin ears swallowed up the seven plump, full ears.\nAnd Pharaoh awoke, and behold, it was a dream. ^{8 }So in the morning\nhis spirit was troubled, and he sent and called for all the magicians of\nEgypt and all its wise men. Pharaoh told them his dreams, but there was\nnone who could interpret them to Pharaoh.\u003c/p\u003e\n\n\u003cp\u003e^{9 }Then the chief cupbearer said to Pharaoh, “I remember my offenses\ntoday. ^{10 }When Pharaoh was angry with his servants and put me and the\nchief baker in custody in the house of the captain of the guard,\n^{11 }we dreamed on the same night, he and I, each having a dream with\nits own interpretation. ^{12 }A young Hebrew was there with us, a\nservant of the captain of the guard. When we told him, he interpreted\nour dreams to us, giving an interpretation to each man according to his\ndream. ^{13 }And as he interpreted to us, so it came about. I was\nrestored to my office, and the baker was hanged.”\u003c/p\u003e\n\n\u003cp\u003e^{14 }Then Pharaoh sent and called Joseph, and they quickly brought him\nout of the pit. And when he had shaved himself and changed his clothes,\nhe came in before Pharaoh. ^{15 }And Pharaoh said to Joseph, “I have had\na dream, and there is no one who can interpret it. I have heard it said\nof you that when you hear a dream you can interpret it.” ^{16 }Joseph\nanswered Pharaoh, “It is not in me; Elohim will give Pharaoh a favorable\nanswer.”\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#fen-ESV-1212a\"\u003ea\u003c/a\u003e]\u003c/sup\u003e\n^{17 }Then Pharaoh said to Joseph, “Behold, in my dream I was standing\non the banks of the Nile. ^{18 }Seven cows, plump and attractive, came\nup out of the Nile and fed in the reed grass. ^{19 }Seven other cows\ncame up after them, poor and very ugly and thin, such as I had never\nseen in all the land of Egypt. ^{20 }And the thin, ugly cows ate up the\nfirst seven plump cows, ^{21 }but when they had eaten them no one would\nhave known that they had eaten them, for they were still as ugly as at\nthe beginning. Then I awoke. ^{22 }I also saw in my dream seven ears\ngrowing on one stalk, full and good. ^{23 }Seven ears, withered, thin,\nand blighted by the east wind, sprouted after them, ^{24 }and the thin\nears swallowed up the seven good ears. And I told it to the magicians,\nbut there was no one who could explain it to me.”\u003c/p\u003e\n\n\u003cp\u003e^{25 }Then Joseph said to Pharaoh, “The dreams of Pharaoh are\none; Elohim has revealed to Pharaoh what he is about to do. ^{26 }The\nseven good cows are seven years, and the seven good ears are seven\nyears; the dreams are one. ^{27 }The seven lean and ugly cows that came\nup after them are seven years, and the seven empty ears blighted by the\neast wind are also seven years of famine. ^{28 }It is as I told\nPharaoh; Elohim has shown to Pharaoh what he is about to do. ^{29 }There\nwill come seven years of great plenty throughout all the land of Egypt,\n^{30 }but after them there will arise seven years of famine, and all the\nplenty will be forgotten in the land of Egypt. The famine will consume\nthe land, ^{31 }and the plenty will be unknown in the land by reason of\nthe famine that will follow, for it will be very severe. ^{32 }And the\ndoubling of Pharaoh\u0026rsquo;s dream means that the thing is fixed by Elohim,\nand Elohim will shortly bring it about. ^{33 }Now therefore let Pharaoh\nselect a discerning and wise man, and set him over the land of Egypt.\n^{34 }Let Pharaoh proceed to appoint overseers over the land and take\none-fifth of the produce of the\nland\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#fen-ESV-1230b\"\u003eb\u003c/a\u003e]\u003c/sup\u003e\nof Egypt during the seven plentiful years. ^{35 }And let them gather all\nthe food of these good years that are coming and store up grain under\nthe authority of Pharaoh for food in the cities, and let them keep it.\n^{36 }That food shall be a reserve for the land against the seven years\nof famine that are to occur in the land of Egypt, so that the land may\nnot perish through the famine.”\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eJoseph Rises to Power\u003c/p\u003e\n\n\u003cp\u003e^{37 }This proposal pleased Pharaoh and all his servants. ^{38 }And\nPharaoh said to his servants, “Can we find a man like this, in whom is\nthe Spirit of\nElohim?”\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#fen-ESV-1234c\"\u003ec\u003c/a\u003e]\u003c/sup\u003e\n^{39 }Then Pharaoh said to Joseph, “Since Elohim has shown you all this,\nthere is none so discerning and wise as you are. ^{40 }You shall be over\nmy house, and all my people shall order themselves as you\ncommand.\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#fen-ESV-1236d\"\u003ed\u003c/a\u003e]\u003c/sup\u003e\nOnly as regards the throne will I be greater than you.” ^{41 }And\nPharaoh said to Joseph, “See, I have set you over all the land of\nEgypt.” ^{42 }Then Pharaoh took his signet ring from his hand and put it\non Joseph\u0026rsquo;s hand, and clothed him in garments of fine linen and put a\ngold chain about his neck. ^{43 }And he made him ride in his second\nchariot. And they called out before him, “Bow the\nknee!”\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#fen-ESV-1239e\"\u003ee\u003c/a\u003e]\u003c/sup\u003e\nThus he set him over all the land of Egypt. ^{44 }Moreover, Pharaoh said\nto Joseph, “I am Pharaoh, and without your consent no one shall lift up\nhand or foot in all the land of Egypt.” ^{45 }And Pharaoh called\nJoseph\u0026rsquo;s name Zaphenath-paneah. And he gave him in marriage Asenath, the\ndaughter of Potiphera priest of On. So Joseph went out over the land of\nEgypt.\u003c/p\u003e\n\n\u003cp\u003e^{46 }Joseph was thirty years old when he entered the service of Pharaoh\nking of Egypt. And Joseph went out from the presence of Pharaoh and went\nthrough all the land of Egypt. ^{47 }During the seven plentiful years\nthe earth produced abundantly, ^{48 }and he gathered up all the food of\nthese seven years, which occurred in the land of Egypt, and put the food\nin the cities. He put in every city the food from the fields around it.\n^{49 }And Joseph stored up grain in great abundance, like the sand of\nthe sea, until he ceased to measure it, for it could not be measured.\u003c/p\u003e\n\n\u003cp\u003e^{50 }Before the year of famine came, two sons were born to Joseph.\nAsenath, the daughter of Potiphera priest of On, bore them to him.\n^{51 }Joseph called the name of the firstborn Manasseh. “For,” he said,\n“Elohim has made me forget all my hardship and all my father\u0026rsquo;s\nhouse.”\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#fen-ESV-1247f\"\u003ef\u003c/a\u003e]\u003c/sup\u003e\n^{52 }The name of the second he called Ephraim, “For Elohim has made me\nfruitful in the land of my\naffliction.”\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#fen-ESV-1248g\"\u003eg\u003c/a\u003e]\u003c/sup\u003e\u003c/p\u003e\n\n\u003cp\u003e^{53 }The seven years of plenty that occurred in the land of Egypt came\nto an end, ^{54 }and the seven years of famine began to come, as Joseph\nhad said. There was famine in all lands, but in all the land of Egypt\nthere was bread. ^{55 }When all the land of Egypt was famished, the\npeople cried to Pharaoh for bread. Pharaoh said to all the Egyptians,\n“Go to Joseph. What he says to you, do.”\u003c/p\u003e\n\n\u003cp\u003e^{56 }So when the famine had spread over all the land, Joseph opened all\nthe\nstorehouses\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#fen-ESV-1252h\"\u003eh\u003c/a\u003e]\u003c/sup\u003e\nand sold to the Egyptians, for the famine was severe in the land of\nEgypt. ^{57 }Moreover, all the earth came to Egypt to Joseph to buy\ngrain, because the famine was severe over all the earth.\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eJoseph\u0026rsquo;s Brothers Go to Egypt\u003c/p\u003e\n\n\u003cp\u003e*42* When Jacob learned that there was grain for sale in Egypt, he said\nto his sons, “Why do you look at one another?” ^{2 }And he said,\n“Behold, I have heard that there is grain for sale in Egypt. Go down and\nbuy grain for us there, that we may live and not die.” ^{3 }So ten of\nJoseph\u0026rsquo;s brothers went down to buy grain in Egypt. ^{4 }But Jacob did\nnot send Benjamin, Joseph\u0026rsquo;s brother, with his brothers, for he feared\nthat harm might happen to him. ^{5 }Thus the sons of Israel came to buy\namong the others who came, for the famine was in the land of Canaan.\u003c/p\u003e\n\n\u003cp\u003e^{6 }Now Joseph was governor over the land. He was the one who sold to\nall the people of the land. And Joseph\u0026rsquo;s brothers came and bowed\nthemselves before him with their faces to the ground. ^{7 }Joseph saw\nhis brothers and recognized them, but he treated them like strangers and\nspoke roughly to them. “Where do you come from?” he said. They said,\n“From the land of Canaan, to buy food.” ^{8 }And Joseph recognized his\nbrothers, but they did not recognize him. ^{9 }And Joseph remembered the\ndreams that he had dreamed of them. And he said to them, “You are spies;\nyou have come to see the nakedness of the land.” ^{10 }They said to him,\n“No, my lord, your servants have come to buy food. ^{11 }We are all sons\nof one man. We are honest men. Your servants have never been spies.”\u003c/p\u003e\n\n\u003cp\u003e^{12 }He said to them, “No, it is the nakedness of the land that you\nhave come to see.” ^{13 }And they said, “We, your servants, are twelve\nbrothers, the sons of one man in the land of Canaan, and behold, the\nyoungest is this day with our father, and one is no more.” ^{14 }But\nJoseph said to them, “It is as I said to you. You are spies. ^{15 }By\nthis you shall be tested: by the life of Pharaoh, you shall not go from\nthis place unless your youngest brother comes here. ^{16 }Send one of\nyou, and let him bring your brother, while you remain confined, that\nyour words may be tested, whether there is truth in you. Or else, by the\nlife of Pharaoh, surely you are spies.” ^{17 }And he put them all\ntogether in custody for three days.\u003c/p\u003e\n\n\u003cp\u003e^{18 }On the third day Joseph said to them, “Do this and you will live,\nfor I fear Elohim: ^{19 }if you are honest men, let one of your brothers\nremain confined where you are in custody, and let the rest go and carry\ngrain for the famine of your households, ^{20 }and bring your youngest\nbrother to me. So your words will be verified, and you shall not die.”\nAnd they did so. ^{21 }Then they said to one another, “In truth we are\nguilty concerning our brother, in that we saw the distress of his soul,\nwhen he begged us and we did not listen. That is why this distress has\ncome upon us.” ^{22 }And Reuben answered them, “Did I not tell you not\nto sin against the boy? But you did not listen. So now there comes a\nreckoning for his blood.” ^{23 }They did not know that Joseph understood\nthem, for there was an interpreter between them. ^{24 }Then he turned\naway from them and wept. And he returned to them and spoke to them. And\nhe took Simeon from them and bound him before their eyes. ^{25 }And\nJoseph gave orders to fill their bags with grain, and to replace every\nman\u0026rsquo;s money in his sack, and to give them provisions for the journey.\nThis was done for them.\u003c/p\u003e\n\n\u003cp\u003e^{26 }Then they loaded their donkeys with their grain and departed.\n^{27 }And as one of them opened his sack to give his donkey fodder at\nthe lodging place, he saw his money in the mouth of his sack. ^{28 }He\nsaid to his brothers, “My money has been put back; here it is in the\nmouth of my sack!” At this their hearts failed them, and they turned\ntrembling to one another, saying, “What is this that Elohim has done to\nus?”\u003c/p\u003e\n\n\u003cp\u003e^{29 }When they came to Jacob their father in the land of Canaan, they\ntold him all that had happened to them, saying, ^{30 }“The man, the lord\nof the land, spoke roughly to us and took us to be spies of the land.\n^{31 }But we said to him, ‘We are honest men; we have never been spies.\n^{32 }We are twelve brothers, sons of our father. One is no more, and\nthe youngest is this day with our father in the land of Canaan.\u0026rsquo;\n^{33 }Then the man, the lord of the land, said to us, ‘By this I shall\nknow that you are honest men: leave one of your brothers with me, and\ntake grain for the famine of your households, and go your way.\n^{34 }Bring your youngest brother to me. Then I shall know that you are\nnot spies but honest men, and I will deliver your brother to you, and\nyou shall trade in the land.\u0026lsquo;”\u003c/p\u003e\n\n\u003cp\u003e^{35 }As they emptied their sacks, behold, every man\u0026rsquo;s bundle of money\nwas in his sack. And when they and their father saw their bundles of\nmoney, they were afraid. ^{36 }And Jacob their father said to them, “You\nhave bereaved me of my children: Joseph is no more, and Simeon is no\nmore, and now you would take Benjamin. All this has come against me.”\n^{37 }Then Reuben said to his father, “Kill my two sons if I do not\nbring him back to you. Put him in my hands, and I will bring him back to\nyou.” ^{38 }But he said, “My son shall not go down with you, for his\nbrother is dead, and he is the only one left. If harm should happen to\nhim on the journey that you are to make, you would bring down my gray\nhairs with sorrow to Sheol.”\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eJoseph\u0026rsquo;s Brothers Return to Egypt\u003c/p\u003e\n\n\u003cp\u003e*43* Now the famine was severe in the land. ^{2 }And when they had eaten\nthe grain that they had brought from Egypt, their father said to them,\n“Go again, buy us a little food.” ^{3 }But Judah said to him, “The man\nsolemnly warned us, saying, ‘You shall not see my face unless your\nbrother is with you.\u0026rsquo; ^{4 }If you will send our brother with us, we will\ngo down and buy you food. ^{5 }But if you will not send him, we will not\ngo down, for the man said to us, ‘You shall not see my face, unless your\nbrother is with you.\u0026lsquo;” ^{6 }Israel said, “Why did you treat me so badly\nas to tell the man that you had another brother?” ^{7 }They replied,\n“The man questioned us carefully about ourselves and our kindred,\nsaying, ‘Is your father still alive? Do you have another brother?\u0026rsquo; What\nwe told him was in answer to these questions. Could we in any way know\nthat he would say, ‘Bring your brother down\u0026rsquo;?” ^{8 }And Judah said to\nIsrael his father, “Send the boy with me, and we will arise and go, that\nwe may live and not die, both we and you and also our little ones.\n^{9 }I will be a pledge of his safety. From my hand you shall require\nhim. If I do not bring him back to you and set him before you, then let\nme bear the blame forever. ^{10 }If we had not delayed, we would now\nhave returned twice.”\u003c/p\u003e\n\n\u003cp\u003e^{11 }Then their father Israel said to them, “If it must be so, then do\nthis: take some of the choice fruits of the land in your bags, and carry\na present down to the man, a little balm and a little honey, gum, myrrh,\npistachio nuts, and almonds. ^{12 }Take double the money with you. Carry\nback with you the money that was returned in the mouth of your sacks.\nPerhaps it was an oversight. ^{13 }Take also your brother, and arise, go\nagain to the man. ^{14 }May Elohim\nAlmighty\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#fen-ESV-1305i\"\u003ei\u003c/a\u003e]\u003c/sup\u003e\ngrant you mercy before the man, and may he send back your other brother\nand Benjamin. And as for me, if I am bereaved of my children, I am\nbereaved.”\u003c/p\u003e\n\n\u003cp\u003e^{15 }So the men took this present, and they took double the money with\nthem, and Benjamin. They arose and went down to Egypt and stood before\nJoseph.\u003c/p\u003e\n\n\u003cp\u003e^{16 }When Joseph saw Benjamin with them, he said to the steward of his\nhouse, “Bring the men into the house, and slaughter an animal and make\nready, for the men are to dine with me at noon.” ^{17 }The man did as\nJoseph told him and brought the men to Joseph\u0026rsquo;s house. ^{18 }And the men\nwere afraid because they were brought to Joseph\u0026rsquo;s house, and they said,\n“It is because of the money, which was replaced in our sacks the first\ntime, that we are brought in, so that he may assault us and fall upon us\nto make us servants and seize our donkeys.” ^{19 }So they went up to the\nsteward of Joseph\u0026rsquo;s house and spoke with him at the door of the house,\n^{20 }and said, “Oh, my lord, we came down the first time to buy food.\n^{21 }And when we came to the lodging place we opened our sacks, and\nthere was each man\u0026rsquo;s money in the mouth of his sack, our money in full\nweight. So we have brought it again with us, ^{22 }and we have brought\nother money down with us to buy food. We do not know who put our money\nin our sacks.” ^{23 }He replied, “Peace to you, do not be afraid.\nYour Elohim and the Elohim of your father has put treasure in your sacks\nfor you. I received your money.” Then he brought Simeon out to them.\n^{24 }And when the man had brought the men into Joseph\u0026rsquo;s house and given\nthem water, and they had washed their feet, and when he had given their\ndonkeys fodder, ^{25 }they prepared the present for Joseph\u0026rsquo;s coming at\nnoon, for they heard that they should eat bread there.\u003c/p\u003e\n\n\u003cp\u003e^{26 }When Joseph came home, they brought into the house to him the\npresent that they had with them and bowed down to him to the ground.\n^{27 }And he inquired about their welfare and said, “Is your father\nwell, the old man of whom you spoke? Is he still alive?” ^{28 }They\nsaid, “Your servant our father is well; he is still alive.” And they\nbowed their heads and prostrated themselves. ^{29 }And he lifted up his\neyes and saw his brother Benjamin, his mother\u0026rsquo;s son, and said, “Is this\nyour youngest brother, of whom you spoke to me? Elohim be gracious to\nyou, my son!” ^{30 }Then Joseph hurried out, for his compassion grew\nwarm for his brother, and he sought a place to weep. And he entered his\nchamber and wept there. ^{31 }Then he washed his face and came out. And\ncontrolling himself he said, “Serve the food.” ^{32 }They served him by\nhimself, and them by themselves, and the Egyptians who ate with him by\nthemselves, because the Egyptians could not eat with the Hebrews, for\nthat is an abomination to the Egyptians. ^{33 }And they sat before him,\nthe firstborn according to his birthright and the youngest according to\nhis youth. And the men looked at one another in amazement.\n^{34 }Portions were taken to them from Joseph\u0026rsquo;s table, but Benjamin\u0026rsquo;s\nportion was five times as much as any of theirs. And they drank and were\nmerry\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#fen-ESV-1325j\"\u003ej\u003c/a\u003e]\u003c/sup\u003e\nwith him.\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eJoseph Tests His Brothers\u003c/p\u003e\n\n\u003cp\u003e*44* Then he commanded the steward of his house, “Fill the men\u0026rsquo;s sacks\nwith food, as much as they can carry, and put each man\u0026rsquo;s money in the\nmouth of his sack, ^{2 }and put my cup, the silver cup, in the mouth of\nthe sack of the youngest, with his money for the grain.” And he did as\nJoseph told him.\u003c/p\u003e\n\n\u003cp\u003e^{3 }As soon as the morning was light, the men were sent away with their\ndonkeys. ^{4 }They had gone only a short distance from the city. Now\nJoseph said to his steward, “Up, follow after the men, and when you\novertake them, say to them, ‘Why have you repaid evil for\ngood?\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#fen-ESV-1329k\"\u003ek\u003c/a\u003e]\u003c/sup\u003e\n^{5 }Is it not from this that my lord drinks, and by this that he\npractices divination? You have done evil in doing this.\u0026lsquo;”\u003c/p\u003e\n\n\u003cp\u003e^{6 }When he overtook them, he spoke to them these words. ^{7 }They said\nto him, “Why does my lord speak such words as these? Far be it from your\nservants to do such a thing! ^{8 }Behold, the money that we found in the\nmouths of our sacks we brought back to you from the land of Canaan. How\nthen could we steal silver or gold from your lord\u0026rsquo;s house?\n^{9 }Whichever of your servants is found with it shall die, and we also\nwill be my lord\u0026rsquo;s servants.” ^{10 }He said, “Let it be as you say: he\nwho is found with it shall be my servant, and the rest of you shall be\ninnocent.” ^{11 }Then each man quickly lowered his sack to the ground,\nand each man opened his sack. ^{12 }And he searched, beginning with the\neldest and ending with the youngest. And the cup was found in Benjamin\u0026rsquo;s\nsack. ^{13 }Then they tore their clothes, and every man loaded his\ndonkey, and they returned to the city.\u003c/p\u003e\n\n\u003cp\u003e^{14 }When Judah and his brothers came to Joseph\u0026rsquo;s house, he was still\nthere. They fell before him to the ground. ^{15 }Joseph said to them,\n“What deed is this that you have done? Do you not know that a man like\nme can indeed practice divination?” ^{16 }And Judah said, “What shall we\nsay to my lord? What shall we speak? Or how can we clear\nourselves? Elohim has found out the guilt of your servants; behold, we\nare my lord\u0026rsquo;s servants, both we and he also in whose hand the cup has\nbeen found.” ^{17 }But he said, “Far be it from me that I should do so!\nOnly the man in whose hand the cup was found shall be my servant. But as\nfor you, go up in peace to your father.”\u003c/p\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eFootnotes:\u003c/p\u003e\n\n\u003col\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#en-ESV-1212\"\u003eGenesis\n41:16\u003c/a\u003e Or (compare Samaritan, Septuagint) \u003cem\u003eWithout Elohim it is not\npossible to give Pharaoh an answer about his welfare\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#en-ESV-1230\"\u003eGenesis\n41:34\u003c/a\u003e Or \u003cem\u003eover the land and organize the land\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#en-ESV-1234\"\u003eGenesis\n41:38\u003c/a\u003e Or \u003cem\u003eof the gods\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#en-ESV-1236\"\u003eGenesis\n41:40\u003c/a\u003e Hebrew \u003cem\u003eand according to your command all my people shall\nkiss the ground\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#en-ESV-1239\"\u003eGenesis\n41:43\u003c/a\u003e \u003cem\u003eAbrek\u003c/em\u003e, probably an Egyptian word, similar in sound to the\nHebrew word meaning \u003cem\u003eto kneel\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#en-ESV-1247\"\u003eGenesis\n41:51\u003c/a\u003e \u003cem\u003eManasseh\u003c/em\u003e sounds like the Hebrew for \u003cem\u003emaking to forget\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#en-ESV-1248\"\u003eGenesis\n41:52\u003c/a\u003e \u003cem\u003eEphraim\u003c/em\u003e sounds like the Hebrew for \u003cem\u003emaking fruitful\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#en-ESV-1252\"\u003eGenesis\n41:56\u003c/a\u003e Hebrew \u003cem\u003eall that was in them\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#en-ESV-1305\"\u003eGenesis\n43:14\u003c/a\u003e Hebrew \u003cem\u003eEl Shaddai\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#en-ESV-1325\"\u003eGenesis\n43:34\u003c/a\u003e Hebrew \u003cem\u003eand became intoxicated\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Genesis+41%3A1+-+44%3A17\u0026amp;version=ESV#en-ESV-1329\"\u003eGenesis\n44:4\u003c/a\u003e Septuagint (compare Vulgate) adds \u003cem\u003eWhy have you stolen my\nsilver cup?\u003c/em\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\n\u003cp\u003e \u003c/p\u003e\n\n\u003cp\u003e \u003c/p\u003e\n\n\u003cp\u003e \u003c/p\u003e\n\n\u003cp\u003e \u003c/p\u003e\n\n\u003cp\u003e/\u003cimg src=\"T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage_003.jpg\" alt=\"\" /\u003e\u003cbr /\u003e\n/\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"haftarah\"\u003eHaftarah\u003c/h3\u003e\n\n\u003ch4 id=\"isaiah-61-1-3-text-esv-wlc-audio-esv\"\u003eIsaiah 61:1-3 | \u003ca href=\"https://www.biblegateway.com/passage/?search=Isaiah+61%3A1-3\u0026amp;version=ESV%3BWLC\"\u003eText:ESV;WLC\u003c/a\u003e | \u003ca href=\"http://audio.esvonline.org/hw/23061001-23061003\"\u003eAudio:ESV\u003c/a\u003e\u003c/h4\u003e\n\n\u003cp\u003eEnglish Standard Version (ESV) \u003cbr /\u003e\n\u003cbr /\u003e\u003c/p\u003e\n\n\u003cp\u003e[[\u003ca href=\"http://audio.esvonline.org/hw/23061001-23061003\"\u003efile:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png\u003c/a\u003e]]\u003cbr /\u003e\u003c/p\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eThe Year of YHWH\u0026rsquo;s Favor\u003c/p\u003e\n\n\u003cp\u003e*61 *The Spirit of the Lord Elohim is upon me,\u003cbr /\u003e\n    because YHWH has anointed me\u003cbr /\u003e\nto bring good news to the\npoor;\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Isaiah+61%3A1-3\u0026amp;version=ESV#fen-ESV-18845a\"\u003ea\u003c/a\u003e]\u003c/sup\u003e\u003cbr /\u003e\n    he has sent me to bind up the brokenhearted,\u003cbr /\u003e\nto proclaim liberty to the captives,\u003cbr /\u003e\n    and the opening of the prison to those who are\nbound;\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Isaiah+61%3A1-3\u0026amp;version=ESV#fen-ESV-18845b\"\u003eb\u003c/a\u003e]\u003c/sup\u003e\u003cbr /\u003e\n^{2 }to proclaim the year of YHWH\u0026rsquo;s favor,\u003cbr /\u003e\n    and the day of vengeance of our Elohim;\u003cbr /\u003e\n    to comfort all who mourn;\u003cbr /\u003e\n^{3 }to grant to those who mourn in Zion\u0026mdash;\u003cbr /\u003e\n    to give them a beautiful headdress instead of ashes,\u003cbr /\u003e\nthe oil of gladness instead of mourning,\u003cbr /\u003e\n    the garment of praise instead of a faint spirit;\u003cbr /\u003e\nthat they may be called oaks of righteousness,\u003cbr /\u003e\n    the planting of YHWH, that he may be\nglorified.\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Isaiah+61%3A1-3\u0026amp;version=ESV#fen-ESV-18847c\"\u003ec\u003c/a\u003e]\u003c/sup\u003e\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eFootnotes:\u003c/p\u003e\n\n\u003col\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Isaiah+61%3A1-3\u0026amp;version=ESV#en-ESV-18845\"\u003eIsaiah\n61:1\u003c/a\u003e Or \u003cem\u003eafflicted\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Isaiah+61%3A1-3\u0026amp;version=ESV#en-ESV-18845\"\u003eIsaiah\n61:1\u003c/a\u003e Or \u003cem\u003ethe opening\u003c/em\u003e [of the eyes] \u003cem\u003eto those who are blind\u003c/em\u003e;\nSeptuagint \u003cem\u003eand recovery of sight to the blind\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Isaiah+61%3A1-3\u0026amp;version=ESV#en-ESV-18847\"\u003eIsaiah\n61:3\u003c/a\u003e Or \u003cem\u003ethat he may display his beauty\u003c/em\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\n\u003cp\u003e \u003c/p\u003e\n\n\u003cp\u003e \u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch4 id=\"zechariah-3-1-4-7-text-esv-wlc-audio-esv\"\u003eZechariah 3:1 - 4:7 | \u003ca href=\"https://www.biblegateway.com/passage/?search=Zechariah+3%3A1+-+4%3A7\u0026amp;version=ESV%3BWLC\"\u003eText:ESV;WLC\u003c/a\u003e | \u003ca href=\"http://audio.esvonline.org/hw/38003001-38004007\"\u003eAudio:ESV\u003c/a\u003e\u003c/h4\u003e\n\n\u003cp\u003eEnglish Standard Version (ESV) \u003cbr /\u003e\n\u003cbr /\u003e\u003c/p\u003e\n\n\u003cp\u003e[[\u003ca href=\"http://audio.esvonline.org/hw/38003001-38004007\"\u003efile:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png\u003c/a\u003e]]\u003cbr /\u003e\u003c/p\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eA Vision of Joshua the High Priest\u003c/p\u003e\n\n\u003cp\u003e*3* Then he showed me Joshua the high priest standing before the angel\nof YHWH, and\nSatan\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Zechariah+3%3A1+-+4%3A7\u0026amp;version=ESV#fen-ESV-22914a\"\u003ea\u003c/a\u003e]\u003c/sup\u003e\nstanding at his right hand to accuse him. ^{2 }And YHWH said to Satan,\n“YHWH rebuke you, O Satan! YHWH who has chosen Jerusalem rebuke you! Is\nnot this a\nbrand\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Zechariah+3%3A1+-+4%3A7\u0026amp;version=ESV#fen-ESV-22915b\"\u003eb\u003c/a\u003e]\u003c/sup\u003e\nplucked from the fire?” ^{3 }Now Joshua was standing before the angel,\nclothed with filthy garments. ^{4 }And the angel said to those who were\nstanding before him, “Remove the filthy garments from him.” And to him\nhe said, “Behold, I have taken your iniquity away from you, and I will\nclothe you with pure vestments.” ^{5 }And I said, “Let them put a clean\nturban on his head.” So they put a clean turban on his head and clothed\nhim with garments. And the angel of YHWH was standing by.\u003c/p\u003e\n\n\u003cp\u003e^{6 }And the angel of YHWH solemnly assured Joshua, ^{7 }“Thus says YHWH\nof hosts: If you will walk in my ways and keep my charge, then you shall\nrule my house and have charge of my courts, and I will give you the\nright of access among those who are standing here. ^{8 }Hear now, O\nJoshua the high priest, you and your friends who sit before you, for\nthey are men who are a sign: behold, I will bring my servant the Branch.\n^{9 }For behold, on the stone that I have set before Joshua, on a single\nstone with seven\neyes,\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Zechariah+3%3A1+-+4%3A7\u0026amp;version=ESV#fen-ESV-22922c\"\u003ec\u003c/a\u003e]\u003c/sup\u003e\nI will engrave its inscription, declares YHWH of hosts, and I will\nremove the iniquity of this land in a single day. ^{10 }In that day,\ndeclares YHWH of hosts, every one of you will invite his neighbor to\ncome under his vine and under his fig tree.”\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eA Vision of a Golden Lampstand\u003c/p\u003e\n\n\u003cp\u003e*4* And the angel who talked with me came again and woke me, like a man\nwho is awakened out of his sleep. ^{2 }And he said to me, “What do you\nsee?” I said, “I see, and behold, a lampstand all of gold, with a bowl\non the top of it, and seven lamps on it, with seven lips on each of the\nlamps that are on the top of it. ^{3 }And there are two olive trees by\nit, one on the right of the bowl and the other on its left.” ^{4 }And I\nsaid to the angel who talked with me, “What are these, my lord?”\n^{5 }Then the angel who talked with me answered and said to me, “Do you\nnot know what these are?” I said, “No, my lord.” ^{6 }Then he said to\nme, “This is the word of YHWH to Zerubbabel: Not by might, nor by power,\nbut by my Spirit, says YHWH of hosts. ^{7 }Who are you, O great\nmountain? Before Zerubbabel you shall become a plain. And he shall bring\nforward the top stone amid shouts of ‘Grace, grace to it!\u0026lsquo;”\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eFootnotes:\u003c/p\u003e\n\n\u003col\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Zechariah+3%3A1+-+4%3A7\u0026amp;version=ESV#en-ESV-22914\"\u003eZechariah\n3:1\u003c/a\u003e Hebrew \u003cem\u003ethe Accuser\u003c/em\u003e or \u003cem\u003ethe Adversary\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Zechariah+3%3A1+-+4%3A7\u0026amp;version=ESV#en-ESV-22915\"\u003eZechariah\n3:2\u003c/a\u003e That is, a burning stick\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Zechariah+3%3A1+-+4%3A7\u0026amp;version=ESV#en-ESV-22922\"\u003eZechariah\n3:9\u003c/a\u003e Or \u003cem\u003efacets\u003c/em\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\n\u003cp\u003e \u003c/p\u003e\n\n\u003cp\u003e \u003c/p\u003e\n\n\u003cp\u003e_\u003cimg src=\"T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage_002.jpg\" alt=\"\" /\u003e_\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3 id=\"brit-hadasha\"\u003eBrit Hadasha\u003c/h3\u003e\n\n\u003ch4 id=\"luke-4-16-30-text-esv-hhh-audio-esv\"\u003eLuke 4:16-30 | \u003ca href=\"https://www.biblegateway.com/passage/?search=Luke+4%3A16-30%3B+Acts+7%3A11-12%3B+1+Corinthians+2%3A1-5\u0026amp;version=ESV%3BHHH\"\u003eText:ESV;HHH\u003c/a\u003e | \u003ca href=\"http://audio.esvonline.org/hw/42004016-42004030\"\u003eAudio:ESV\u003c/a\u003e\u003c/h4\u003e\n\n\u003cp\u003eEnglish Standard Version (ESV) \u003cbr /\u003e\n\u003cbr /\u003e\u003c/p\u003e\n\n\u003cp\u003e[[\u003ca href=\"http://audio.esvonline.org/hw/42004016-42004030\"\u003efile:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png\u003c/a\u003e\u003cbr /\u003e\n]]\u003c/p\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eYeshua Rejected at Nazareth\u003c/p\u003e\n\n\u003cp\u003e^{16 }And he came to Nazareth, where he had been brought up. And as was\nhis custom, he went to the synagogue on the Sabbath day, and he stood up\nto read. ^{17 }And the scroll of the prophet Isaiah was given to him. He\nunrolled the scroll and found the place where it was written,\u003c/p\u003e\n\n\u003cp\u003e^{18 }“The Spirit of the Lord is upon me,\u003cbr /\u003e\n    because he has anointed me\u003cbr /\u003e\n    to proclaim good news to the poor.\u003cbr /\u003e\nHe has sent me to proclaim liberty to the captives\u003cbr /\u003e\n    and recovering of sight to the blind,\u003cbr /\u003e\n    to set at liberty those who are oppressed,\u003cbr /\u003e\n^{19 }to proclaim the year of the Lord\u0026rsquo;s favor.”\u003c/p\u003e\n\n\u003cp\u003e^{20 }And he rolled up the scroll and gave it back to the attendant and\nsat down. And the eyes of all in the synagogue were fixed on him.\n^{21 }And he began to say to them, “Today this Scripture has been\nfulfilled in your hearing.” ^{22 }And all spoke well of him and marveled\nat the gracious words that were coming from his mouth. And they said,\n“Is not this Joseph\u0026rsquo;s son?” ^{23 }And he said to them, “Doubtless you\nwill quote to me this proverb, ‘Physician, heal yourself.\u0026rsquo; What we have\nheard you did at Capernaum, do here in your hometown as well.” ^{24 }And\nhe said, “Truly, I say to you, no prophet is acceptable in his hometown.\n^{25 }But in truth, I tell you, there were many widows in Israel in the\ndays of Elijah, when the heavens were shut up three years and six\nmonths, and a great famine came over all the land, ^{26 }and Elijah was\nsent to none of them but only to Zarephath, in the land of Sidon, to a\nwoman who was a widow. ^{27 }And there were many\nlepers\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=Luke+4%3A16-30\u0026amp;version=ESV#fen-ESV-25082a\"\u003ea\u003c/a\u003e]\u003c/sup\u003e\nin Israel in the time of the prophet Elisha, and none of them was\ncleansed, but only Naaman the Syrian.” ^{28 }When they heard these\nthings, all in the synagogue were filled with wrath. ^{29 }And they rose\nup and drove him out of the town and brought him to the brow of the hill\non which their town was built, so that they could throw him down the\ncliff. ^{30 }But passing through their midst, he went away.\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eFootnotes:\u003c/p\u003e\n\n\u003col\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=Luke+4%3A16-30\u0026amp;version=ESV#en-ESV-25082\"\u003eLuke\n4:27\u003c/a\u003e \u003cem\u003eLeprosy\u003c/em\u003e was a term for several skin diseases; see\n\u003ca href=\"https://www.biblegateway.com/passage/?search=Lev.13\u0026amp;version=ESV\"\u003eLeviticus\n13\\\u003cbr /\u003e\n\u003c/a\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\n\u003cp\u003e \u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch4 id=\"acts-7-11-12-text-esv-hhh-audio-esv\"\u003eActs 7:11-12 | \u003ca href=\"https://www.biblegateway.com/passage/?search=Acts+7%3A11-12%3B+1+Corinthians+2%3A1-5\u0026amp;version=ESV%3BHHH\"\u003eText:ESV;HHH\u003c/a\u003e | \u003ca href=\"http://audio.esvonline.org/hw/44007011-44007012\"\u003eAudio:ESV\u003c/a\u003e\u003c/h4\u003e\n\n\u003cp\u003eEnglish Standard Version (ESV) \u003cbr /\u003e\n\u003cbr /\u003e\u003c/p\u003e\n\n\u003cp\u003e[[\u003ca href=\"http://audio.esvonline.org/hw/44007011-44007012\"\u003efile:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png\u003c/a\u003e]]\u003c/p\u003e\n\n\u003cp\u003e^{11 }Now there came a famine throughout all Egypt and Canaan, and great\naffliction, and our fathers could find no food. ^{12 }But when Jacob\nheard that there was grain in Egypt, he sent out our fathers on their\nfirst visit.\u003c/p\u003e\n\n\u003ch4 id=\"1-corinthians-2-1-5-text-esv-hhh-audio-esv\"\u003e1 Corinthians 2:1-5 | \u003ca href=\"https://www.biblegateway.com/passage/?search=1+Corinthians+2%3A1-5\u0026amp;version=ESV%3BHHH\"\u003eText:ESV;HHH\u003c/a\u003e | \u003ca href=\"http://audio.esvonline.org/hw/46002001-46002005\"\u003eAudio:ESV\u003c/a\u003e\u003c/h4\u003e\n\n\u003cp\u003eEnglish Standard Version (ESV) \u003cbr /\u003e\n\u003cbr /\u003e\u003c/p\u003e\n\n\u003cp\u003e[[\u003ca href=\"http://audio.esvonline.org/hw/46002001-46002005\"\u003efile:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png\u003c/a\u003e]]\u003c/p\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eProclaiming HaMashiach Crucified\u003c/p\u003e\n\n\u003cp\u003e*2 *And I, when I came to you,\nbrothers,\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=1+Corinthians+2%3A1-5\u0026amp;version=ESV#fen-ESV-28379a\"\u003ea\u003c/a\u003e]\u003c/sup\u003e\ndid not come proclaiming to you the\ntestimony\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=1+Corinthians+2%3A1-5\u0026amp;version=ESV#fen-ESV-28379b\"\u003eb\u003c/a\u003e]\u003c/sup\u003e\nof Elohim with lofty speech or wisdom. ^{2 }For I decided to know\nnothing among you except Yeshua HaMashiach and him crucified. ^{3 }And I\nwas with you in weakness and in fear and much trembling, ^{4 }and my\nspeech and my message were not in plausible words of wisdom, but in\ndemonstration of the Spirit and of power, ^{5 }so that your faith might\nnot rest in the wisdom of\nmen\u003csup\u003e[\u003ca href=\"https://www.biblegateway.com/passage/?search=1+Corinthians+2%3A1-5\u0026amp;version=ESV#fen-ESV-28383c\"\u003ec\u003c/a\u003e]\u003c/sup\u003e\nbut in the power of Elohim.\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--list-separator--\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eFootnotes:\u003c/p\u003e\n\n\u003col\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=1+Corinthians+2%3A1-5\u0026amp;version=ESV#en-ESV-28379\"\u003e1\nCorinthians 2:1\u003c/a\u003e Or \u003cem\u003ebrothers and sisters\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=1+Corinthians+2%3A1-5\u0026amp;version=ESV#en-ESV-28379\"\u003e1\nCorinthians 2:1\u003c/a\u003e Some manuscripts \u003cem\u003emystery\u003c/em\u003e (or \u003cem\u003esecret\u003c/em\u003e)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.biblegateway.com/passage/?search=1+Corinthians+2%3A1-5\u0026amp;version=ESV#en-ESV-28383\"\u003e1\nCorinthians 2:5\u003c/a\u003e The Greek word \u003cem\u003eanthropoi\u003c/em\u003e can refer to both men\nand women\u003c/li\u003e\n\u003c/ol\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2 id=\"2020-notes\"\u003e2020 notes\u003c/h2\u003e\n","text":"  Table of Contents  Parasha Miketz / מקץ / From the End  Torah  Genesis 41:1 - 44:17 | Text:ESV;WLC | Audio:ESV  Haftarah  Isaiah 61:1-3 | Text:ESV;WLC | Audio:ESV Zechariah 3:1 - 4:7 | Text:ESV;WLC | Audio:ESV  Brit Hadasha  Luke 4:16-30 | Text:ESV;HHH | Audio:ESV Acts 7:11-12 | Text:ESV;HHH | Audio:ESV 1 Corinthians 2:1-5 | Text:ESV;HHH | Audio:ESV   2020 notes   \nIMAGE PRIOR | NEXT\nParasha Miketz / מקץ / From the End Torah Genesis 41:1 - 44:17 | Text:ESV;WLC | Audio:ESV English Standard Version (ESV) [[file:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png]]\n  Joseph Interprets Pharaoh\u0026rsquo;s Dreams\n*41* After two whole years, Pharaoh dreamed that he was standing by the Nile, ^{2 }and behold, there came up out of the Nile seven cows attractive and plump, and they fed in the reed grass. ^{3 }And behold, seven other cows, ugly and thin, came up out of the Nile after them, and stood by the other cows on the bank of the Nile. ^{4 }And the ugly, thin cows ate up the seven attractive, plump cows. And Pharaoh awoke. ^{5 }And he fell asleep and dreamed a second time. And behold, seven ears of grain, plump and good, were growing on one stalk. ^{6 }And behold, after them sprouted seven ears, thin and blighted by the east wind. ^{7 }And the thin ears swallowed up the seven plump, full ears. And Pharaoh awoke, and behold, it was a dream. ^{8 }So in the morning his spirit was troubled, and he sent and called for all the magicians of Egypt and all its wise men. Pharaoh told them his dreams, but there was none who could interpret them to Pharaoh.\n^{9 }Then the chief cupbearer said to Pharaoh, “I remember my offenses today. ^{10 }When Pharaoh was angry with his servants and put me and the chief baker in custody in the house of the captain of the guard, ^{11 }we dreamed on the same night, he and I, each having a dream with its own interpretation. ^{12 }A young Hebrew was there with us, a servant of the captain of the guard. When we told him, he interpreted our dreams to us, giving an interpretation to each man according to his dream. ^{13 }And as he interpreted to us, so it came about. I was restored to my office, and the baker was hanged.”\n^{14 }Then Pharaoh sent and called Joseph, and they quickly brought him out of the pit. And when he had shaved himself and changed his clothes, he came in before Pharaoh. ^{15 }And Pharaoh said to Joseph, “I have had a dream, and there is no one who can interpret it. I have heard it said of you that when you hear a dream you can interpret it.” ^{16 }Joseph answered Pharaoh, “It is not in me; Elohim will give Pharaoh a favorable answer.”[a] ^{17 }Then Pharaoh said to Joseph, “Behold, in my dream I was standing on the banks of the Nile. ^{18 }Seven cows, plump and attractive, came up out of the Nile and fed in the reed grass. ^{19 }Seven other cows came up after them, poor and very ugly and thin, such as I had never seen in all the land of Egypt. ^{20 }And the thin, ugly cows ate up the first seven plump cows, ^{21 }but when they had eaten them no one would have known that they had eaten them, for they were still as ugly as at the beginning. Then I awoke. ^{22 }I also saw in my dream seven ears growing on one stalk, full and good. ^{23 }Seven ears, withered, thin, and blighted by the east wind, sprouted after them, ^{24 }and the thin ears swallowed up the seven good ears. And I told it to the magicians, but there was no one who could explain it to me.”\n^{25 }Then Joseph said to Pharaoh, “The dreams of Pharaoh are one; Elohim has revealed to Pharaoh what he is about to do. ^{26 }The seven good cows are seven years, and the seven good ears are seven years; the dreams are one. ^{27 }The seven lean and ugly cows that came up after them are seven years, and the seven empty ears blighted by the east wind are also seven years of famine. ^{28 }It is as I told Pharaoh; Elohim has shown to Pharaoh what he is about to do. ^{29 }There will come seven years of great plenty throughout all the land of Egypt, ^{30 }but after them there will arise seven years of famine, and all the plenty will be forgotten in the land of Egypt. The famine will consume the land, ^{31 }and the plenty will be unknown in the land by reason of the famine that will follow, for it will be very severe. ^{32 }And the doubling of Pharaoh\u0026rsquo;s dream means that the thing is fixed by Elohim, and Elohim will shortly bring it about. ^{33 }Now therefore let Pharaoh select a discerning and wise man, and set him over the land of Egypt. ^{34 }Let Pharaoh proceed to appoint overseers over the land and take one-fifth of the produce of the land[b] of Egypt during the seven plentiful years. ^{35 }And let them gather all the food of these good years that are coming and store up grain under the authority of Pharaoh for food in the cities, and let them keep it. ^{36 }That food shall be a reserve for the land against the seven years of famine that are to occur in the land of Egypt, so that the land may not perish through the famine.”\n    Joseph Rises to Power\n^{37 }This proposal pleased Pharaoh and all his servants. ^{38 }And Pharaoh said to his servants, “Can we find a man like this, in whom is the Spirit of Elohim?”[c] ^{39 }Then Pharaoh said to Joseph, “Since Elohim has shown you all this, there is none so discerning and wise as you are. ^{40 }You shall be over my house, and all my people shall order themselves as you command.[d] Only as regards the throne will I be greater than you.” ^{41 }And Pharaoh said to Joseph, “See, I have set you over all the land of Egypt.” ^{42 }Then Pharaoh took his signet ring from his hand and put it on Joseph\u0026rsquo;s hand, and clothed him in garments of fine linen and put a gold chain about his neck. ^{43 }And he made him ride in his second chariot. And they called out before him, “Bow the knee!”[e] Thus he set him over all the land of Egypt. ^{44 }Moreover, Pharaoh said to Joseph, “I am Pharaoh, and without your consent no one shall lift up hand or foot in all the land of Egypt.” ^{45 }And Pharaoh called Joseph\u0026rsquo;s name Zaphenath-paneah. And he gave him in marriage Asenath, the daughter of Potiphera priest of On. So Joseph went out over the land of Egypt.\n^{46 }Joseph was thirty years old when he entered the service of Pharaoh king of Egypt. And Joseph went out from the presence of Pharaoh and went through all the land of Egypt. ^{47 }During the seven plentiful years the earth produced abundantly, ^{48 }and he gathered up all the food of these seven years, which occurred in the land of Egypt, and put the food in the cities. He put in every city the food from the fields around it. ^{49 }And Joseph stored up grain in great abundance, like the sand of the sea, until he ceased to measure it, for it could not be measured.\n^{50 }Before the year of famine came, two sons were born to Joseph. Asenath, the daughter of Potiphera priest of On, bore them to him. ^{51 }Joseph called the name of the firstborn Manasseh. “For,” he said, “Elohim has made me forget all my hardship and all my father\u0026rsquo;s house.”[f] ^{52 }The name of the second he called Ephraim, “For Elohim has made me fruitful in the land of my affliction.”[g]\n^{53 }The seven years of plenty that occurred in the land of Egypt came to an end, ^{54 }and the seven years of famine began to come, as Joseph had said. There was famine in all lands, but in all the land of Egypt there was bread. ^{55 }When all the land of Egypt was famished, the people cried to Pharaoh for bread. Pharaoh said to all the Egyptians, “Go to Joseph. What he says to you, do.”\n^{56 }So when the famine had spread over all the land, Joseph opened all the storehouses[h] and sold to the Egyptians, for the famine was severe in the land of Egypt. ^{57 }Moreover, all the earth came to Egypt to Joseph to buy grain, because the famine was severe over all the earth.\n    Joseph\u0026rsquo;s Brothers Go to Egypt\n*42* When Jacob learned that there was grain for sale in Egypt, he said to his sons, “Why do you look at one another?” ^{2 }And he said, “Behold, I have heard that there is grain for sale in Egypt. Go down and buy grain for us there, that we may live and not die.” ^{3 }So ten of Joseph\u0026rsquo;s brothers went down to buy grain in Egypt. ^{4 }But Jacob did not send Benjamin, Joseph\u0026rsquo;s brother, with his brothers, for he feared that harm might happen to him. ^{5 }Thus the sons of Israel came to buy among the others who came, for the famine was in the land of Canaan.\n^{6 }Now Joseph was governor over the land. He was the one who sold to all the people of the land. And Joseph\u0026rsquo;s brothers came and bowed themselves before him with their faces to the ground. ^{7 }Joseph saw his brothers and recognized them, but he treated them like strangers and spoke roughly to them. “Where do you come from?” he said. They said, “From the land of Canaan, to buy food.” ^{8 }And Joseph recognized his brothers, but they did not recognize him. ^{9 }And Joseph remembered the dreams that he had dreamed of them. And he said to them, “You are spies; you have come to see the nakedness of the land.” ^{10 }They said to him, “No, my lord, your servants have come to buy food. ^{11 }We are all sons of one man. We are honest men. Your servants have never been spies.”\n^{12 }He said to them, “No, it is the nakedness of the land that you have come to see.” ^{13 }And they said, “We, your servants, are twelve brothers, the sons of one man in the land of Canaan, and behold, the youngest is this day with our father, and one is no more.” ^{14 }But Joseph said to them, “It is as I said to you. You are spies. ^{15 }By this you shall be tested: by the life of Pharaoh, you shall not go from this place unless your youngest brother comes here. ^{16 }Send one of you, and let him bring your brother, while you remain confined, that your words may be tested, whether there is truth in you. Or else, by the life of Pharaoh, surely you are spies.” ^{17 }And he put them all together in custody for three days.\n^{18 }On the third day Joseph said to them, “Do this and you will live, for I fear Elohim: ^{19 }if you are honest men, let one of your brothers remain confined where you are in custody, and let the rest go and carry grain for the famine of your households, ^{20 }and bring your youngest brother to me. So your words will be verified, and you shall not die.” And they did so. ^{21 }Then they said to one another, “In truth we are guilty concerning our brother, in that we saw the distress of his soul, when he begged us and we did not listen. That is why this distress has come upon us.” ^{22 }And Reuben answered them, “Did I not tell you not to sin against the boy? But you did not listen. So now there comes a reckoning for his blood.” ^{23 }They did not know that Joseph understood them, for there was an interpreter between them. ^{24 }Then he turned away from them and wept. And he returned to them and spoke to them. And he took Simeon from them and bound him before their eyes. ^{25 }And Joseph gave orders to fill their bags with grain, and to replace every man\u0026rsquo;s money in his sack, and to give them provisions for the journey. This was done for them.\n^{26 }Then they loaded their donkeys with their grain and departed. ^{27 }And as one of them opened his sack to give his donkey fodder at the lodging place, he saw his money in the mouth of his sack. ^{28 }He said to his brothers, “My money has been put back; here it is in the mouth of my sack!” At this their hearts failed them, and they turned trembling to one another, saying, “What is this that Elohim has done to us?”\n^{29 }When they came to Jacob their father in the land of Canaan, they told him all that had happened to them, saying, ^{30 }“The man, the lord of the land, spoke roughly to us and took us to be spies of the land. ^{31 }But we said to him, ‘We are honest men; we have never been spies. ^{32 }We are twelve brothers, sons of our father. One is no more, and the youngest is this day with our father in the land of Canaan.\u0026rsquo; ^{33 }Then the man, the lord of the land, said to us, ‘By this I shall know that you are honest men: leave one of your brothers with me, and take grain for the famine of your households, and go your way. ^{34 }Bring your youngest brother to me. Then I shall know that you are not spies but honest men, and I will deliver your brother to you, and you shall trade in the land.\u0026lsquo;”\n^{35 }As they emptied their sacks, behold, every man\u0026rsquo;s bundle of money was in his sack. And when they and their father saw their bundles of money, they were afraid. ^{36 }And Jacob their father said to them, “You have bereaved me of my children: Joseph is no more, and Simeon is no more, and now you would take Benjamin. All this has come against me.” ^{37 }Then Reuben said to his father, “Kill my two sons if I do not bring him back to you. Put him in my hands, and I will bring him back to you.” ^{38 }But he said, “My son shall not go down with you, for his brother is dead, and he is the only one left. If harm should happen to him on the journey that you are to make, you would bring down my gray hairs with sorrow to Sheol.”\n    Joseph\u0026rsquo;s Brothers Return to Egypt\n*43* Now the famine was severe in the land. ^{2 }And when they had eaten the grain that they had brought from Egypt, their father said to them, “Go again, buy us a little food.” ^{3 }But Judah said to him, “The man solemnly warned us, saying, ‘You shall not see my face unless your brother is with you.\u0026rsquo; ^{4 }If you will send our brother with us, we will go down and buy you food. ^{5 }But if you will not send him, we will not go down, for the man said to us, ‘You shall not see my face, unless your brother is with you.\u0026lsquo;” ^{6 }Israel said, “Why did you treat me so badly as to tell the man that you had another brother?” ^{7 }They replied, “The man questioned us carefully about ourselves and our kindred, saying, ‘Is your father still alive? Do you have another brother?\u0026rsquo; What we told him was in answer to these questions. Could we in any way know that he would say, ‘Bring your brother down\u0026rsquo;?” ^{8 }And Judah said to Israel his father, “Send the boy with me, and we will arise and go, that we may live and not die, both we and you and also our little ones. ^{9 }I will be a pledge of his safety. From my hand you shall require him. If I do not bring him back to you and set him before you, then let me bear the blame forever. ^{10 }If we had not delayed, we would now have returned twice.”\n^{11 }Then their father Israel said to them, “If it must be so, then do this: take some of the choice fruits of the land in your bags, and carry a present down to the man, a little balm and a little honey, gum, myrrh, pistachio nuts, and almonds. ^{12 }Take double the money with you. Carry back with you the money that was returned in the mouth of your sacks. Perhaps it was an oversight. ^{13 }Take also your brother, and arise, go again to the man. ^{14 }May Elohim Almighty[i] grant you mercy before the man, and may he send back your other brother and Benjamin. And as for me, if I am bereaved of my children, I am bereaved.”\n^{15 }So the men took this present, and they took double the money with them, and Benjamin. They arose and went down to Egypt and stood before Joseph.\n^{16 }When Joseph saw Benjamin with them, he said to the steward of his house, “Bring the men into the house, and slaughter an animal and make ready, for the men are to dine with me at noon.” ^{17 }The man did as Joseph told him and brought the men to Joseph\u0026rsquo;s house. ^{18 }And the men were afraid because they were brought to Joseph\u0026rsquo;s house, and they said, “It is because of the money, which was replaced in our sacks the first time, that we are brought in, so that he may assault us and fall upon us to make us servants and seize our donkeys.” ^{19 }So they went up to the steward of Joseph\u0026rsquo;s house and spoke with him at the door of the house, ^{20 }and said, “Oh, my lord, we came down the first time to buy food. ^{21 }And when we came to the lodging place we opened our sacks, and there was each man\u0026rsquo;s money in the mouth of his sack, our money in full weight. So we have brought it again with us, ^{22 }and we have brought other money down with us to buy food. We do not know who put our money in our sacks.” ^{23 }He replied, “Peace to you, do not be afraid. Your Elohim and the Elohim of your father has put treasure in your sacks for you. I received your money.” Then he brought Simeon out to them. ^{24 }And when the man had brought the men into Joseph\u0026rsquo;s house and given them water, and they had washed their feet, and when he had given their donkeys fodder, ^{25 }they prepared the present for Joseph\u0026rsquo;s coming at noon, for they heard that they should eat bread there.\n^{26 }When Joseph came home, they brought into the house to him the present that they had with them and bowed down to him to the ground. ^{27 }And he inquired about their welfare and said, “Is your father well, the old man of whom you spoke? Is he still alive?” ^{28 }They said, “Your servant our father is well; he is still alive.” And they bowed their heads and prostrated themselves. ^{29 }And he lifted up his eyes and saw his brother Benjamin, his mother\u0026rsquo;s son, and said, “Is this your youngest brother, of whom you spoke to me? Elohim be gracious to you, my son!” ^{30 }Then Joseph hurried out, for his compassion grew warm for his brother, and he sought a place to weep. And he entered his chamber and wept there. ^{31 }Then he washed his face and came out. And controlling himself he said, “Serve the food.” ^{32 }They served him by himself, and them by themselves, and the Egyptians who ate with him by themselves, because the Egyptians could not eat with the Hebrews, for that is an abomination to the Egyptians. ^{33 }And they sat before him, the firstborn according to his birthright and the youngest according to his youth. And the men looked at one another in amazement. ^{34 }Portions were taken to them from Joseph\u0026rsquo;s table, but Benjamin\u0026rsquo;s portion was five times as much as any of theirs. And they drank and were merry[j] with him.\n    Joseph Tests His Brothers\n*44* Then he commanded the steward of his house, “Fill the men\u0026rsquo;s sacks with food, as much as they can carry, and put each man\u0026rsquo;s money in the mouth of his sack, ^{2 }and put my cup, the silver cup, in the mouth of the sack of the youngest, with his money for the grain.” And he did as Joseph told him.\n^{3 }As soon as the morning was light, the men were sent away with their donkeys. ^{4 }They had gone only a short distance from the city. Now Joseph said to his steward, “Up, follow after the men, and when you overtake them, say to them, ‘Why have you repaid evil for good?[k] ^{5 }Is it not from this that my lord drinks, and by this that he practices divination? You have done evil in doing this.\u0026lsquo;”\n^{6 }When he overtook them, he spoke to them these words. ^{7 }They said to him, “Why does my lord speak such words as these? Far be it from your servants to do such a thing! ^{8 }Behold, the money that we found in the mouths of our sacks we brought back to you from the land of Canaan. How then could we steal silver or gold from your lord\u0026rsquo;s house? ^{9 }Whichever of your servants is found with it shall die, and we also will be my lord\u0026rsquo;s servants.” ^{10 }He said, “Let it be as you say: he who is found with it shall be my servant, and the rest of you shall be innocent.” ^{11 }Then each man quickly lowered his sack to the ground, and each man opened his sack. ^{12 }And he searched, beginning with the eldest and ending with the youngest. And the cup was found in Benjamin\u0026rsquo;s sack. ^{13 }Then they tore their clothes, and every man loaded his donkey, and they returned to the city.\n^{14 }When Judah and his brothers came to Joseph\u0026rsquo;s house, he was still there. They fell before him to the ground. ^{15 }Joseph said to them, “What deed is this that you have done? Do you not know that a man like me can indeed practice divination?” ^{16 }And Judah said, “What shall we say to my lord? What shall we speak? Or how can we clear ourselves? Elohim has found out the guilt of your servants; behold, we are my lord\u0026rsquo;s servants, both we and he also in whose hand the cup has been found.” ^{17 }But he said, “Far be it from me that I should do so! Only the man in whose hand the cup was found shall be my servant. But as for you, go up in peace to your father.”\n  Footnotes:\n Genesis 41:16 Or (compare Samaritan, Septuagint) Without Elohim it is not possible to give Pharaoh an answer about his welfare Genesis 41:34 Or over the land and organize the land Genesis 41:38 Or of the gods Genesis 41:40 Hebrew and according to your command all my people shall kiss the ground Genesis 41:43 Abrek, probably an Egyptian word, similar in sound to the Hebrew word meaning to kneel Genesis 41:51 Manasseh sounds like the Hebrew for making to forget Genesis 41:52 Ephraim sounds like the Hebrew for making fruitful Genesis 41:56 Hebrew all that was in them Genesis 43:14 Hebrew El Shaddai Genesis 43:34 Hebrew and became intoxicated Genesis 44:4 Septuagint (compare Vulgate) adds Why have you stolen my silver cup?      //\n   Haftarah Isaiah 61:1-3 | Text:ESV;WLC | Audio:ESV English Standard Version (ESV) [[file:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png]]\n  The Year of YHWH\u0026rsquo;s Favor\n*61 *The Spirit of the Lord Elohim is upon me,\nbecause YHWH has anointed me\nto bring good news to the poor;[a]\nhe has sent me to bind up the brokenhearted,\nto proclaim liberty to the captives,\nand the opening of the prison to those who are bound;[b]\n^{2 }to proclaim the year of YHWH\u0026rsquo;s favor,\nand the day of vengeance of our Elohim;\nto comfort all who mourn;\n^{3 }to grant to those who mourn in Zion\u0026mdash;\nto give them a beautiful headdress instead of ashes,\nthe oil of gladness instead of mourning,\nthe garment of praise instead of a faint spirit;\nthat they may be called oaks of righteousness,\nthe planting of YHWH, that he may be glorified.[c]\n    Footnotes:\n Isaiah 61:1 Or afflicted Isaiah 61:1 Or the opening [of the eyes] to those who are blind; Septuagint and recovery of sight to the blind Isaiah 61:3 Or that he may display his beauty      Zechariah 3:1 - 4:7 | Text:ESV;WLC | Audio:ESV English Standard Version (ESV) [[file:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png]]\n  A Vision of Joshua the High Priest\n*3* Then he showed me Joshua the high priest standing before the angel of YHWH, and Satan[a] standing at his right hand to accuse him. ^{2 }And YHWH said to Satan, “YHWH rebuke you, O Satan! YHWH who has chosen Jerusalem rebuke you! Is not this a brand[b] plucked from the fire?” ^{3 }Now Joshua was standing before the angel, clothed with filthy garments. ^{4 }And the angel said to those who were standing before him, “Remove the filthy garments from him.” And to him he said, “Behold, I have taken your iniquity away from you, and I will clothe you with pure vestments.” ^{5 }And I said, “Let them put a clean turban on his head.” So they put a clean turban on his head and clothed him with garments. And the angel of YHWH was standing by.\n^{6 }And the angel of YHWH solemnly assured Joshua, ^{7 }“Thus says YHWH of hosts: If you will walk in my ways and keep my charge, then you shall rule my house and have charge of my courts, and I will give you the right of access among those who are standing here. ^{8 }Hear now, O Joshua the high priest, you and your friends who sit before you, for they are men who are a sign: behold, I will bring my servant the Branch. ^{9 }For behold, on the stone that I have set before Joshua, on a single stone with seven eyes,[c] I will engrave its inscription, declares YHWH of hosts, and I will remove the iniquity of this land in a single day. ^{10 }In that day, declares YHWH of hosts, every one of you will invite his neighbor to come under his vine and under his fig tree.”\n    A Vision of a Golden Lampstand\n*4* And the angel who talked with me came again and woke me, like a man who is awakened out of his sleep. ^{2 }And he said to me, “What do you see?” I said, “I see, and behold, a lampstand all of gold, with a bowl on the top of it, and seven lamps on it, with seven lips on each of the lamps that are on the top of it. ^{3 }And there are two olive trees by it, one on the right of the bowl and the other on its left.” ^{4 }And I said to the angel who talked with me, “What are these, my lord?” ^{5 }Then the angel who talked with me answered and said to me, “Do you not know what these are?” I said, “No, my lord.” ^{6 }Then he said to me, “This is the word of YHWH to Zerubbabel: Not by might, nor by power, but by my Spirit, says YHWH of hosts. ^{7 }Who are you, O great mountain? Before Zerubbabel you shall become a plain. And he shall bring forward the top stone amid shouts of ‘Grace, grace to it!\u0026lsquo;”\n    Footnotes:\n Zechariah 3:1 Hebrew the Accuser or the Adversary Zechariah 3:2 That is, a burning stick Zechariah 3:9 Or facets    __\n  Brit Hadasha Luke 4:16-30 | Text:ESV;HHH | Audio:ESV English Standard Version (ESV) [[file:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png\n]]\n  Yeshua Rejected at Nazareth\n^{16 }And he came to Nazareth, where he had been brought up. And as was his custom, he went to the synagogue on the Sabbath day, and he stood up to read. ^{17 }And the scroll of the prophet Isaiah was given to him. He unrolled the scroll and found the place where it was written,\n^{18 }“The Spirit of the Lord is upon me,\nbecause he has anointed me\nto proclaim good news to the poor.\nHe has sent me to proclaim liberty to the captives\nand recovering of sight to the blind,\nto set at liberty those who are oppressed,\n^{19 }to proclaim the year of the Lord\u0026rsquo;s favor.”\n^{20 }And he rolled up the scroll and gave it back to the attendant and sat down. And the eyes of all in the synagogue were fixed on him. ^{21 }And he began to say to them, “Today this Scripture has been fulfilled in your hearing.” ^{22 }And all spoke well of him and marveled at the gracious words that were coming from his mouth. And they said, “Is not this Joseph\u0026rsquo;s son?” ^{23 }And he said to them, “Doubtless you will quote to me this proverb, ‘Physician, heal yourself.\u0026rsquo; What we have heard you did at Capernaum, do here in your hometown as well.” ^{24 }And he said, “Truly, I say to you, no prophet is acceptable in his hometown. ^{25 }But in truth, I tell you, there were many widows in Israel in the days of Elijah, when the heavens were shut up three years and six months, and a great famine came over all the land, ^{26 }and Elijah was sent to none of them but only to Zarephath, in the land of Sidon, to a woman who was a widow. ^{27 }And there were many lepers[a] in Israel in the time of the prophet Elisha, and none of them was cleansed, but only Naaman the Syrian.” ^{28 }When they heard these things, all in the synagogue were filled with wrath. ^{29 }And they rose up and drove him out of the town and brought him to the brow of the hill on which their town was built, so that they could throw him down the cliff. ^{30 }But passing through their midst, he went away.\n    Footnotes:\n Luke 4:27 Leprosy was a term for several skin diseases; see Leviticus 13\\\n     Acts 7:11-12 | Text:ESV;HHH | Audio:ESV English Standard Version (ESV) [[file:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png]]\n^{11 }Now there came a famine throughout all Egypt and Canaan, and great affliction, and our fathers could find no food. ^{12 }But when Jacob heard that there was grain in Egypt, he sent out our fathers on their first visit.\n1 Corinthians 2:1-5 | Text:ESV;HHH | Audio:ESV English Standard Version (ESV) [[file:T10%20-%20Miketz%20%7C%20119%20Ministries_files/monkimage.png]]\n  Proclaiming HaMashiach Crucified\n*2 *And I, when I came to you, brothers,[a] did not come proclaiming to you the testimony[b] of Elohim with lofty speech or wisdom. ^{2 }For I decided to know nothing among you except Yeshua HaMashiach and him crucified. ^{3 }And I was with you in weakness and in fear and much trembling, ^{4 }and my speech and my message were not in plausible words of wisdom, but in demonstration of the Spirit and of power, ^{5 }so that your faith might not rest in the wisdom of men[c] but in the power of Elohim.\n    Footnotes:\n 1 Corinthians 2:1 Or brothers and sisters 1 Corinthians 2:1 Some manuscripts mystery (or secret) 1 Corinthians 2:5 The Greek word anthropoi can refer to both men and women   2020 notes "},"name":"Parasha Miketz / מקץ / From the End","published":"2020-12-29T00:05:31-03:00","summary":"Table of Contents  Parasha Miketz / מקץ / From the End  Torah  Genesis 41:1 - 44:17 | Text:ESV;WLC | Audio:ESV  Haftarah  Isaiah 61:1-3 | Text:ESV;WLC | Audio:ESV Zechariah 3:1 - 4:7 | Text:ESV;WLC | Audio:ESV  Brit Hadasha  Luke 4:16-30 | Text:ESV;HHH | Audio:ESV Acts 7:11-12 | Text:ESV;HHH | Audio:ESV 1 Corinthians 2:1-5 | Text:ESV;HHH | Audio:ESV   2020 notes","type":"entry","url":"https://albertdelafuente.com/exobrain/20201228202719-parasha_miketz/"}